#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AwsGameLiftClient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AwsGameLiftClient.EGameLiftErrors
// NumValues: 0x002A
enum class EGameLiftErrors : uint8
{
	INCOMPLETE_SIGNATURE                     = 0,
	INTERNAL_FAILURE                         = 1,
	INVALID_ACTION                           = 2,
	INVALID_CLIENT_TOKEN_ID                  = 3,
	INVALID_PARAMETER_COMBINATION            = 4,
	INVALID_QUERY_PARAMETER                  = 5,
	INVALID_PARAMETER_VALUE                  = 6,
	MISSING_ACTION                           = 7,
	MISSING_AUTHENTICATION_TOKEN             = 8,
	MISSING_PARAMETER                        = 9,
	OPT_IN_REQUIRED                          = 10,
	REQUEST_EXPIRED                          = 11,
	SERVICE_UNAVAILABLE                      = 12,
	THROTTLING                               = 13,
	VALIDATION                               = 14,
	ACCESS_DENIED                            = 15,
	RESOURCE_NOT_FOUND                       = 16,
	UNRECOGNIZED_CLIENT                      = 17,
	MALFORMED_QUERY_STRING                   = 18,
	SLOW_DOWN                                = 19,
	REQUEST_TIME_TOO_SKEWED                  = 20,
	INVALID_SIGNATURE                        = 21,
	SIGNATURE_DOES_NOT_MATCH                 = 22,
	INVALID_ACCESS_KEY_ID                    = 23,
	REQUEST_TIMEOUT                          = 24,
	NETWORK_CONNECTION                       = 99,
	UNKNOWN                                  = 100,
	FLEET_CAPACITY_EXCEEDED                  = 130,
	GAME_SESSION_FULL                        = 131,
	IDEMPOTENT_PARAMETER_MISMATCH            = 132,
	INTERNAL_SERVICE                         = 133,
	INVALID_FLEET_STATUS                     = 134,
	INVALID_GAME_SESSION_STATUS              = 135,
	INVALID_REQUEST                          = 136,
	LIMIT_EXCEEDED                           = 137,
	NOT_FOUND                                = 138,
	OUT_OF_CAPACITY                          = 139,
	TAGGING_FAILED                           = 140,
	TERMINAL_ROUTING_STRATEGY                = 141,
	UNAUTHORIZED                             = 142,
	UNSUPPORTED_REGION                       = 143,
	EGameLiftErrors_MAX                      = 144,
};

// Enum AwsGameLiftClient.EGameServerUtilizationStatus
// NumValues: 0x0004
enum class EGameServerUtilizationStatus : uint8
{
	NOT_SET                                  = 0,
	AVAILABLE                                = 1,
	UTILIZED                                 = 2,
	EGameServerUtilizationStatus_MAX         = 3,
};

// Enum AwsGameLiftClient.EGameServerClaimStatus
// NumValues: 0x0003
enum class EGameServerClaimStatus : uint8
{
	NOT_SET                                  = 0,
	CLAIMED                                  = 1,
	EGameServerClaimStatus_MAX               = 2,
};

// Enum AwsGameLiftClient.ERoutingStrategyType
// NumValues: 0x0004
enum class ERoutingStrategyType : uint8
{
	NOT_SET                                  = 0,
	SIMPLE                                   = 1,
	TERMINAL                                 = 2,
	ERoutingStrategyType_MAX                 = 3,
};

// Enum AwsGameLiftClient.EOperatingSystem
// NumValues: 0x0005
enum class EOperatingSystem : uint8
{
	NOT_SET                                  = 0,
	WINDOWS_2012                             = 1,
	AMAZON_LINUX                             = 2,
	AMAZON_LINUX_2                           = 3,
	EOperatingSystem_MAX                     = 4,
};

// Enum AwsGameLiftClient.EBuildStatus
// NumValues: 0x0005
enum class EBuildStatus : uint8
{
	NOT_SET                                  = 0,
	INITIALIZED                              = 1,
	READY                                    = 2,
	FAILED                                   = 3,
	EBuildStatus_MAX                         = 4,
};

// Enum AwsGameLiftClient.EComputeType
// NumValues: 0x0004
enum class EComputeType : uint8
{
	NOT_SET                                  = 0,
	EC2                                      = 1,
	ANYWHERE                                 = 2,
	EComputeType_MAX                         = 3,
};

// Enum AwsGameLiftClient.ECertificateType
// NumValues: 0x0004
enum class ECertificateType : uint8
{
	NOT_SET                                  = 0,
	DISABLED                                 = 1,
	GENERATED                                = 2,
	ECertificateType_MAX                     = 3,
};

// Enum AwsGameLiftClient.EFleetAction
// NumValues: 0x0003
enum class EFleetAction : uint8
{
	NOT_SET                                  = 0,
	AUTO_SCALING                             = 1,
	EFleetAction_MAX                         = 2,
};

// Enum AwsGameLiftClient.EProtectionPolicy
// NumValues: 0x0004
enum class EProtectionPolicy : uint8
{
	NOT_SET                                  = 0,
	NoProtection                             = 1,
	FullProtection                           = 2,
	EProtectionPolicy_MAX                    = 3,
};

// Enum AwsGameLiftClient.EFleetStatus
// NumValues: 0x000C
enum class EFleetStatus : uint8
{
	NOT_SET                                  = 0,
	NEW_                                     = 1,
	DOWNLOADING                              = 2,
	VALIDATING                               = 3,
	BUILDING                                 = 4,
	ACTIVATING                               = 5,
	ACTIVE                                   = 6,
	DELETING                                 = 7,
	ERROR_                                   = 8,
	TERMINATED                               = 9,
	NOT_FOUND                                = 10,
	EFleetStatus_MAX                         = 11,
};

// Enum AwsGameLiftClient.EEC2InstanceType
// NumValues: 0x0074
enum class EEC2InstanceType : uint8
{
	NOT_SET                                  = 0,
	T2_micro                                 = 1,
	T2_small                                 = 2,
	T2_medium                                = 3,
	T2_large                                 = 4,
	C3_large                                 = 5,
	C3_xlarge                                = 6,
	C3_2xlarge                               = 7,
	C3_4xlarge                               = 8,
	C3_8xlarge                               = 9,
	C4_large                                 = 10,
	C4_xlarge                                = 11,
	C4_2xlarge                               = 12,
	C4_4xlarge                               = 13,
	C4_8xlarge                               = 14,
	C5_large                                 = 15,
	C5_xlarge                                = 16,
	C5_2xlarge                               = 17,
	C5_4xlarge                               = 18,
	C5_9xlarge                               = 19,
	C5_12xlarge                              = 20,
	C5_18xlarge                              = 21,
	C5_24xlarge                              = 22,
	C5a_large                                = 23,
	C5a_xlarge                               = 24,
	C5a_2xlarge                              = 25,
	C5a_4xlarge                              = 26,
	C5a_8xlarge                              = 27,
	C5a_12xlarge                             = 28,
	C5a_16xlarge                             = 29,
	C5a_24xlarge                             = 30,
	R3_large                                 = 31,
	R3_xlarge                                = 32,
	R3_2xlarge                               = 33,
	R3_4xlarge                               = 34,
	R3_8xlarge                               = 35,
	R4_large                                 = 36,
	R4_xlarge                                = 37,
	R4_2xlarge                               = 38,
	R4_4xlarge                               = 39,
	R4_8xlarge                               = 40,
	R4_16xlarge                              = 41,
	R5_large                                 = 42,
	R5_xlarge                                = 43,
	R5_2xlarge                               = 44,
	R5_4xlarge                               = 45,
	R5_8xlarge                               = 46,
	R5_12xlarge                              = 47,
	R5_16xlarge                              = 48,
	R5_24xlarge                              = 49,
	R5a_large                                = 50,
	R5a_xlarge                               = 51,
	R5a_2xlarge                              = 52,
	R5a_4xlarge                              = 53,
	R5a_8xlarge                              = 54,
	R5a_12xlarge                             = 55,
	R5a_16xlarge                             = 56,
	R5a_24xlarge                             = 57,
	M3_medium                                = 58,
	M3_large                                 = 59,
	M3_xlarge                                = 60,
	M3_2xlarge                               = 61,
	M4_large                                 = 62,
	M4_xlarge                                = 63,
	M4_2xlarge                               = 64,
	M4_4xlarge                               = 65,
	M4_10xlarge                              = 66,
	M5_large                                 = 67,
	M5_xlarge                                = 68,
	M5_2xlarge                               = 69,
	M5_4xlarge                               = 70,
	M5_8xlarge                               = 71,
	M5_12xlarge                              = 72,
	M5_16xlarge                              = 73,
	M5_24xlarge                              = 74,
	M5a_large                                = 75,
	M5a_xlarge                               = 76,
	M5a_2xlarge                              = 77,
	M5a_4xlarge                              = 78,
	M5a_8xlarge                              = 79,
	M5a_12xlarge                             = 80,
	M5a_16xlarge                             = 81,
	M5a_24xlarge                             = 82,
	C5d_large                                = 83,
	C5d_xlarge                               = 84,
	C5d_2xlarge                              = 85,
	C5d_4xlarge                              = 86,
	C5d_9xlarge                              = 87,
	C5d_12xlarge                             = 88,
	C5d_18xlarge                             = 89,
	C5d_24xlarge                             = 90,
	C6a_large                                = 91,
	C6a_xlarge                               = 92,
	C6a_2xlarge                              = 93,
	C6a_4xlarge                              = 94,
	C6a_8xlarge                              = 95,
	C6a_12xlarge                             = 96,
	C6a_16xlarge                             = 97,
	C6a_24xlarge                             = 98,
	C6i_large                                = 99,
	C6i_xlarge                               = 100,
	C6i_2xlarge                              = 101,
	C6i_4xlarge                              = 102,
	C6i_8xlarge                              = 103,
	C6i_12xlarge                             = 104,
	C6i_16xlarge                             = 105,
	C6i_24xlarge                             = 106,
	R5d_large                                = 107,
	R5d_xlarge                               = 108,
	R5d_2xlarge                              = 109,
	R5d_4xlarge                              = 110,
	R5d_8xlarge                              = 111,
	R5d_12xlarge                             = 112,
	R5d_16xlarge                             = 113,
	R5d_24xlarge                             = 114,
	EEC2InstanceType_MAX                     = 115,
};

// Enum AwsGameLiftClient.EFleetType
// NumValues: 0x0004
enum class EFleetType : uint8
{
	NOT_SET                                  = 0,
	ON_DEMAND                                = 1,
	SPOT                                     = 2,
	EFleetType_MAX                           = 3,
};

// Enum AwsGameLiftClient.EGameServerGroupAction
// NumValues: 0x0003
enum class EGameServerGroupAction : uint8
{
	NOT_SET                                  = 0,
	REPLACE_INSTANCE_TYPES                   = 1,
	EGameServerGroupAction_MAX               = 2,
};

// Enum AwsGameLiftClient.EGameServerGroupStatus
// NumValues: 0x0009
enum class EGameServerGroupStatus : uint8
{
	NOT_SET                                  = 0,
	NEW_                                     = 1,
	ACTIVATING                               = 2,
	ACTIVE                                   = 3,
	DELETE_SCHEDULED                         = 4,
	DELETING                                 = 5,
	DELETED                                  = 6,
	ERROR_                                   = 7,
	EGameServerGroupStatus_MAX               = 8,
};

// Enum AwsGameLiftClient.EGameServerProtectionPolicy
// NumValues: 0x0004
enum class EGameServerProtectionPolicy : uint8
{
	NOT_SET                                  = 0,
	NO_PROTECTION                            = 1,
	FULL_PROTECTION                          = 2,
	EGameServerProtectionPolicy_MAX          = 3,
};

// Enum AwsGameLiftClient.EBalancingStrategy
// NumValues: 0x0004
enum class EBalancingStrategy : uint8
{
	NOT_SET                                  = 0,
	SPOT_ONLY                                = 1,
	SPOT_PREFERRED                           = 2,
	EBalancingStrategy_MAX                   = 3,
};

// Enum AwsGameLiftClient.EGameServerGroupInstanceType
// NumValues: 0x005A
enum class EGameServerGroupInstanceType : uint8
{
	NOT_SET                                  = 0,
	C4_large                                 = 1,
	C4_xlarge                                = 2,
	C4_2xlarge                               = 3,
	C4_4xlarge                               = 4,
	C4_8xlarge                               = 5,
	C5_large                                 = 6,
	C5_xlarge                                = 7,
	C5_2xlarge                               = 8,
	C5_4xlarge                               = 9,
	C5_9xlarge                               = 10,
	C5_12xlarge                              = 11,
	C5_18xlarge                              = 12,
	C5_24xlarge                              = 13,
	C5a_large                                = 14,
	C5a_xlarge                               = 15,
	C5a_2xlarge                              = 16,
	C5a_4xlarge                              = 17,
	C5a_8xlarge                              = 18,
	C5a_12xlarge                             = 19,
	C5a_16xlarge                             = 20,
	C5a_24xlarge                             = 21,
	C6g_medium                               = 22,
	C6g_large                                = 23,
	C6g_xlarge                               = 24,
	C6g_2xlarge                              = 25,
	C6g_4xlarge                              = 26,
	C6g_8xlarge                              = 27,
	C6g_12xlarge                             = 28,
	C6g_16xlarge                             = 29,
	R4_large                                 = 30,
	R4_xlarge                                = 31,
	R4_2xlarge                               = 32,
	R4_4xlarge                               = 33,
	R4_8xlarge                               = 34,
	R4_16xlarge                              = 35,
	R5_large                                 = 36,
	R5_xlarge                                = 37,
	R5_2xlarge                               = 38,
	R5_4xlarge                               = 39,
	R5_8xlarge                               = 40,
	R5_12xlarge                              = 41,
	R5_16xlarge                              = 42,
	R5_24xlarge                              = 43,
	R5a_large                                = 44,
	R5a_xlarge                               = 45,
	R5a_2xlarge                              = 46,
	R5a_4xlarge                              = 47,
	R5a_8xlarge                              = 48,
	R5a_12xlarge                             = 49,
	R5a_16xlarge                             = 50,
	R5a_24xlarge                             = 51,
	R6g_medium                               = 52,
	R6g_large                                = 53,
	R6g_xlarge                               = 54,
	R6g_2xlarge                              = 55,
	R6g_4xlarge                              = 56,
	R6g_8xlarge                              = 57,
	R6g_12xlarge                             = 58,
	R6g_16xlarge                             = 59,
	M4_large                                 = 60,
	M4_xlarge                                = 61,
	M4_2xlarge                               = 62,
	M4_4xlarge                               = 63,
	M4_10xlarge                              = 64,
	M5_large                                 = 65,
	M5_xlarge                                = 66,
	M5_2xlarge                               = 67,
	M5_4xlarge                               = 68,
	M5_8xlarge                               = 69,
	M5_12xlarge                              = 70,
	M5_16xlarge                              = 71,
	M5_24xlarge                              = 72,
	M5a_large                                = 73,
	M5a_xlarge                               = 74,
	M5a_2xlarge                              = 75,
	M5a_4xlarge                              = 76,
	M5a_8xlarge                              = 77,
	M5a_12xlarge                             = 78,
	M5a_16xlarge                             = 79,
	M5a_24xlarge                             = 80,
	M6g_medium                               = 81,
	M6g_large                                = 82,
	M6g_xlarge                               = 83,
	M6g_2xlarge                              = 84,
	M6g_4xlarge                              = 85,
	M6g_8xlarge                              = 86,
	M6g_12xlarge                             = 87,
	M6g_16xlarge                             = 88,
	EGameServerGroupInstanceType_MAX         = 89,
};

// Enum AwsGameLiftClient.EPlayerSessionCreationPolicy
// NumValues: 0x0004
enum class EPlayerSessionCreationPolicy : uint8
{
	NOT_SET                                  = 0,
	ACCEPT_ALL                               = 1,
	DENY_ALL                                 = 2,
	EPlayerSessionCreationPolicy_MAX         = 3,
};

// Enum AwsGameLiftClient.EGameSessionStatusReason
// NumValues: 0x0003
enum class EGameSessionStatusReason : uint8
{
	NOT_SET                                  = 0,
	INTERRUPTED                              = 1,
	EGameSessionStatusReason_MAX             = 2,
};

// Enum AwsGameLiftClient.EGameSessionStatus
// NumValues: 0x0006
enum class EGameSessionStatus : uint8
{
	NOT_SET                                  = 0,
	ACTIVE                                   = 1,
	ACTIVATING                               = 2,
	TERMINATED                               = 3,
	TERMINATING                              = 4,
	EGameSessionStatus_MAX                   = 5,
};

// Enum AwsGameLiftClient.EBackfillMode
// NumValues: 0x0004
enum class EBackfillMode : uint8
{
	NOT_SET                                  = 0,
	AUTOMATIC                                = 1,
	MANUAL                                   = 2,
	EBackfillMode_MAX                        = 3,
};

// Enum AwsGameLiftClient.EPlayerSessionStatus
// NumValues: 0x0006
enum class EPlayerSessionStatus : uint8
{
	NOT_SET                                  = 0,
	RESERVED                                 = 1,
	ACTIVE                                   = 2,
	COMPLETED                                = 3,
	TIMEDOUT                                 = 4,
	EPlayerSessionStatus_MAX                 = 5,
};

// Enum AwsGameLiftClient.EComputeStatus
// NumValues: 0x0005
enum class EComputeStatus : uint8
{
	NOT_SET                                  = 0,
	PENDING                                  = 1,
	ACTIVE                                   = 2,
	TERMINATING                              = 3,
	EComputeStatus_MAX                       = 4,
};

// Enum AwsGameLiftClient.EEventCode
// NumValues: 0x0024
enum class EEventCode : uint8
{
	NOT_SET                                  = 0,
	GENERIC_EVENT                            = 1,
	FLEET_CREATED                            = 2,
	FLEET_DELETED                            = 3,
	FLEET_SCALING_EVENT                      = 4,
	FLEET_STATE_DOWNLOADING                  = 5,
	FLEET_STATE_VALIDATING                   = 6,
	FLEET_STATE_BUILDING                     = 7,
	FLEET_STATE_ACTIVATING                   = 8,
	FLEET_STATE_ACTIVE                       = 9,
	FLEET_STATE_ERROR                        = 10,
	FLEET_INITIALIZATION_FAILED              = 11,
	FLEET_BINARY_DOWNLOAD_FAILED             = 12,
	FLEET_VALIDATION_LAUNCH_PATH_NOT_FOUND   = 13,
	FLEET_VALIDATION_EXECUTABLE_RUNTIME_FAILURE = 14,
	FLEET_VALIDATION_TIMED_OUT               = 15,
	FLEET_ACTIVATION_FAILED                  = 16,
	FLEET_ACTIVATION_FAILED_NO_INSTANCES     = 17,
	FLEET_NEW_GAME_SESSION_PROTECTION_POLICY_UPDATED = 18,
	SERVER_PROCESS_INVALID_PATH              = 19,
	SERVER_PROCESS_SDK_INITIALIZATION_TIMEOUT = 20,
	SERVER_PROCESS_PROCESS_READY_TIMEOUT     = 21,
	SERVER_PROCESS_CRASHED                   = 22,
	SERVER_PROCESS_TERMINATED_UNHEALTHY      = 23,
	SERVER_PROCESS_FORCE_TERMINATED          = 24,
	SERVER_PROCESS_PROCESS_EXIT_TIMEOUT      = 25,
	GAME_SESSION_ACTIVATION_TIMEOUT          = 26,
	FLEET_CREATION_EXTRACTING_BUILD          = 27,
	FLEET_CREATION_RUNNING_INSTALLER         = 28,
	FLEET_CREATION_VALIDATING_RUNTIME_CONFIG = 29,
	FLEET_VPC_PEERING_SUCCEEDED              = 30,
	FLEET_VPC_PEERING_FAILED                 = 31,
	FLEET_VPC_PEERING_DELETED                = 32,
	INSTANCE_INTERRUPTED                     = 33,
	INSTANCE_RECYCLED                        = 34,
	EEventCode_MAX                           = 35,
};

// Enum AwsGameLiftClient.ELocationUpdateStatus
// NumValues: 0x0003
enum class ELocationUpdateStatus : uint8
{
	NOT_SET                                  = 0,
	PENDING_UPDATE                           = 1,
	ELocationUpdateStatus_MAX                = 2,
};

// Enum AwsGameLiftClient.EIpProtocol
// NumValues: 0x0004
enum class EIpProtocol : uint8
{
	NOT_SET                                  = 0,
	TCP                                      = 1,
	UDP                                      = 2,
	EIpProtocol_MAX                          = 3,
};

// Enum AwsGameLiftClient.EGameServerInstanceStatus
// NumValues: 0x0005
enum class EGameServerInstanceStatus : uint8
{
	NOT_SET                                  = 0,
	ACTIVE                                   = 1,
	DRAINING                                 = 2,
	SPOT_TERMINATING                         = 3,
	EGameServerInstanceStatus_MAX            = 4,
};

// Enum AwsGameLiftClient.EGameSessionPlacementState
// NumValues: 0x0007
enum class EGameSessionPlacementState : uint8
{
	NOT_SET                                  = 0,
	PENDING                                  = 1,
	FULFILLED                                = 2,
	CANCELLED                                = 3,
	TIMED_OUT                                = 4,
	FAILED                                   = 5,
	EGameSessionPlacementState_MAX           = 6,
};

// Enum AwsGameLiftClient.EInstanceStatus
// NumValues: 0x0005
enum class EInstanceStatus : uint8
{
	NOT_SET                                  = 0,
	PENDING                                  = 1,
	ACTIVE                                   = 2,
	TERMINATING                              = 3,
	EInstanceStatus_MAX                      = 4,
};

// Enum AwsGameLiftClient.EMatchmakingConfigurationStatus
// NumValues: 0x000A
enum class EMatchmakingConfigurationStatus : uint8
{
	NOT_SET                                  = 0,
	CANCELLED                                = 1,
	COMPLETED                                = 2,
	FAILED                                   = 3,
	PLACING                                  = 4,
	QUEUED                                   = 5,
	REQUIRES_ACCEPTANCE                      = 6,
	SEARCHING                                = 7,
	TIMED_OUT                                = 8,
	EMatchmakingConfigurationStatus_MAX      = 9,
};

// Enum AwsGameLiftClient.EPolicyType
// NumValues: 0x0004
enum class EPolicyType : uint8
{
	NOT_SET                                  = 0,
	RuleBased                                = 1,
	TargetBased                              = 2,
	EPolicyType_MAX                          = 3,
};

// Enum AwsGameLiftClient.EMetricName
// NumValues: 0x000E
enum class EMetricName : uint8
{
	NOT_SET                                  = 0,
	ActivatingGameSessions                   = 1,
	ActiveGameSessions                       = 2,
	ActiveInstances                          = 3,
	AvailableGameSessions                    = 4,
	AvailablePlayerSessions                  = 5,
	CurrentPlayerSessions                    = 6,
	IdleInstances                            = 7,
	PercentAvailableGameSessions             = 8,
	PercentIdleInstances                     = 9,
	QueueDepth                               = 10,
	WaitTime                                 = 11,
	ConcurrentActivatableGameSessions        = 12,
	EMetricName_MAX                          = 13,
};

// Enum AwsGameLiftClient.EComparisonOperatorType
// NumValues: 0x0006
enum class EComparisonOperatorType : uint8
{
	NOT_SET                                  = 0,
	GreaterThanOrEqualToThreshold            = 1,
	GreaterThanThreshold                     = 2,
	LessThanThreshold                        = 3,
	LessThanOrEqualToThreshold               = 4,
	EComparisonOperatorType_MAX              = 5,
};

// Enum AwsGameLiftClient.EScalingAdjustmentType
// NumValues: 0x0005
enum class EScalingAdjustmentType : uint8
{
	NOT_SET                                  = 0,
	ChangeInCapacity                         = 1,
	ExactCapacity                            = 2,
	PercentChangeInCapacity                  = 3,
	EScalingAdjustmentType_MAX               = 4,
};

// Enum AwsGameLiftClient.EScalingStatusType
// NumValues: 0x0009
enum class EScalingStatusType : uint8
{
	NOT_SET                                  = 0,
	ACTIVE                                   = 1,
	UPDATE_REQUESTED                         = 2,
	UPDATING                                 = 3,
	DELETE_REQUESTED                         = 4,
	DELETING                                 = 5,
	DELETED                                  = 6,
	ERROR_                                   = 7,
	EScalingStatusType_MAX                   = 8,
};

// Enum AwsGameLiftClient.ELocationFilter
// NumValues: 0x0004
enum class ELocationFilter : uint8
{
	NOT_SET                                  = 0,
	AWS                                      = 1,
	CUSTOM                                   = 2,
	ELocationFilter_MAX                      = 3,
};

// Enum AwsGameLiftClient.EAcceptanceType
// NumValues: 0x0004
enum class EAcceptanceType : uint8
{
	NOT_SET                                  = 0,
	ACCEPT                                   = 1,
	REJECT                                   = 2,
	EAcceptanceType_MAX                      = 3,
};

// Enum AwsGameLiftClient.EActivateStatus
// NumValues: 0x0005
enum class EActivateStatus : uint8
{
	ACTIVATE_Success                         = 0,
	ACTIVATE_NoGameLift                      = 1,
	ACTIVATE_NoSuccessCallback               = 2,
	ACTIVATE_NoFailCallback                  = 3,
	ACTIVATE_MAX                             = 4,
};

// Enum AwsGameLiftClient.EGameServerGroupDeleteOption
// NumValues: 0x0005
enum class EGameServerGroupDeleteOption : uint8
{
	NOT_SET                                  = 0,
	SAFE_DELETE                              = 1,
	FORCE_DELETE                             = 2,
	RETAIN                                   = 3,
	EGameServerGroupDeleteOption_MAX         = 4,
};

// Enum AwsGameLiftClient.EGameServerHealthCheck
// NumValues: 0x0003
enum class EGameServerHealthCheck : uint8
{
	NOT_SET                                  = 0,
	HEALTHY                                  = 1,
	EGameServerHealthCheck_MAX               = 2,
};

// Enum AwsGameLiftClient.EGameLiftSortOrder
// NumValues: 0x0004
enum class EGameLiftSortOrder : uint8
{
	NOT_SET                                  = 0,
	ASCENDING                                = 1,
	DESCENDING                               = 2,
	EGameLiftSortOrder_MAX                   = 3,
};

// Enum AwsGameLiftClient.EAttrType
// NumValues: 0x0006
enum class EAttrType : uint8
{
	NONE                                     = 0,
	STRING                                   = 1,
	DOUBLE                                   = 2,
	STRING_LIST                              = 3,
	STRING_DOUBLE_MAP                        = 4,
	EAttrType_MAX                            = 5,
};

// Enum AwsGameLiftClient.EGameLiftScheme
// NumValues: 0x0003
enum class EGameLiftScheme : uint8
{
	HTTP                                     = 0,
	HTTPS                                    = 1,
	EGameLiftScheme_MAX                      = 2,
};

// Enum AwsGameLiftClient.EGameLiftFollowRedirectsPolicy
// NumValues: 0x0004
enum class EGameLiftFollowRedirectsPolicy : uint8
{
	DEFAULT                                  = 0,
	ALWAYS                                   = 1,
	NEVER                                    = 2,
	EGameLiftFollowRedirectsPolicy_MAX       = 3,
};

// ScriptStruct AwsGameLiftClient.FleetUtilization
// 0x0040 (0x0040 - 0x0000)
struct FFleetUtilization final
{
public:
	class FString                                 FleetId;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetArn;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveServerProcessCount;                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveGameSessionCount;                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPlayerSessionCount;                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaximumPlayerSessionCount;                         // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Location;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.DescribeFleetUtilizationResult
// 0x0020 (0x0020 - 0x0000)
struct FDescribeFleetUtilizationResult final
{
public:
	TArray<struct FFleetUtilization>              FleetUtilization;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 NextToken;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GetComputeAuthTokenResult
// 0x0058 (0x0058 - 0x0000)
struct FGetComputeAuthTokenResult final
{
public:
	class FString                                 FleetId;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetArn;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ComputeName;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ComputeArn;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthToken;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ExpirationTimestamp;                               // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.PlayerSession
// 0x00A0 (0x00A0 - 0x0000)
struct FPlayerSession final
{
public:
	class FString                                 PlayerSessionId;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerId;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameSessionID;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetId;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetArn;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CreationTime;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              TerminationTime;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerSessionStatus                          Status;                                            // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B1[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 IpAddress;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DnsName;                                           // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B2[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerData;                                        // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.CreatePlayerSessionResult
// 0x00A0 (0x00A0 - 0x0000)
struct FCreatePlayerSessionResult final
{
public:
	struct FPlayerSession                         PlayerSession;                                     // 0x0000(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GameLiftServer
// 0x0080 (0x0080 - 0x0000)
struct FGameLiftServer final
{
public:
	class FString                                 GameServerGroupName;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameServerGroupArn;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameServerId;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceId;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConnectionInfo;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameServerData;                                    // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameServerClaimStatus                        ClaimStatus;                                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameServerUtilizationStatus                  UtilizationStatus;                                 // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B3[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              RegistrationTime;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastClaimTime;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastHealthCheckTime;                               // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.ClaimGameServerResult
// 0x0080 (0x0080 - 0x0000)
struct FClaimGameServerResult final
{
public:
	struct FGameLiftServer                        GameServer;                                        // 0x0000(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GameLiftGameSessionServerProperties
// 0x0020 (0x0020 - 0x0000)
struct FGameLiftGameSessionServerProperties final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GameSessionData
// 0x00E8 (0x00E8 - 0x0000)
struct FGameSessionData final
{
public:
	class FString                                 GameSessionID;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetId;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FleetArn;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CreationTime;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TerminationTime;                                   // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPlayerSessionCount;                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaximumPlayerSessionCount;                         // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameSessionStatus                            Status;                                            // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameSessionStatusReason                      StatusReason;                                      // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B4[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameLiftGameSessionServerProperties> GameProperties;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 IpAddress;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DnsName;                                           // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayerSessionCreationPolicy                  PlayerSessionCreationPolicy;                       // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B5[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CreatorId;                                         // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameSessionData;                                   // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MatchmakerData;                                    // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Location;                                          // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.RoutingStrategy
// 0x0028 (0x0028 - 0x0000)
struct FRoutingStrategy final
{
public:
	ERoutingStrategyType                          Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FleetId;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.Alias
// 0x0078 (0x0078 - 0x0000)
struct FAlias final
{
public:
	class FString                                 AliasId;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AliasArn;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRoutingStrategy                       RoutingStrategy;                                   // 0x0040(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDateTime                              CreationTime;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastUpdatedTime;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.CreateAliasResult
// 0x0078 (0x0078 - 0x0000)
struct FCreateAliasResult final
{
public:
	struct FAlias                                 Alias;                                             // 0x0000(0x0078)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GameServerInstance
// 0x0038 (0x0038 - 0x0000)
struct FGameServerInstance final
{
public:
	class FString                                 GameServerGroupName;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameServerGroupArn;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceId;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameServerInstanceStatus                     InstanceStatus;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B7[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AwsGameLiftClient.DescribeGameServerInstancesResult
// 0x0020 (0x0020 - 0x0000)
struct FDescribeGameServerInstancesResult final
{
public:
	TArray<struct FGameServerInstance>            GameServerInstances;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 NextToken;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GameLiftCredentials
// 0x0030 (0x0030 - 0x0000)
struct FGameLiftCredentials final
{
public:
	class FString                                 AccessKeyId;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SecretKey;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionToken;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.S3Location
// 0x0040 (0x0040 - 0x0000)
struct FS3Location final
{
public:
	class FString                                 Bucket;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleArn;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ObjectVersion;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.Script
// 0x0098 (0x0098 - 0x0000)
struct FScript final
{
public:
	class FString                                 ScriptId;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ScriptArn;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SizeOnDisk;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CreationTime;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS3Location                            StorageLocation;                                   // 0x0058(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.CreateScriptResult
// 0x0098 (0x0098 - 0x0000)
struct FCreateScriptResult final
{
public:
	struct FScript                                Script;                                            // 0x0000(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.DescribeMatchmakingRuleSetsRequest
// 0x0028 (0x0028 - 0x0000)
struct FDescribeMatchmakingRuleSetsRequest final
{
public:
	TArray<class FString>                         Names;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NextToken;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GetGameSessionLogUrlResult
// 0x0010 (0x0010 - 0x0000)
struct FGetGameSessionLogUrlResult final
{
public:
	class FString                                 PreSignedUrl;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.VpcPeeringAuthorization
// 0x0040 (0x0040 - 0x0000)
struct FVpcPeeringAuthorization final
{
public:
	class FString                                 GameLiftAwsAccountId;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PeerVpcAwsAccountId;                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PeerVpcId;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CreationTime;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ExpirationTime;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.GameLiftBuild
// 0x0078 (0x0078 - 0x0000)
struct FGameLiftBuild final
{
public:
	class FString                                 BuildId;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BuildArn;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBuildStatus                                  Status;                                            // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B9[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SizeOnDisk;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOperatingSystem                              OperatingSystem;                                   // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16BA[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CreationTime;                                      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerSdkVersion;                                  // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.AwsCredentials
// 0x0030 (0x0030 - 0x0000)
struct FAwsCredentials final
{
public:
	class FString                                 AccessKeyId;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SecretAccessKey;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionToken;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.CreateBuildResult
// 0x00E8 (0x00E8 - 0x0000)
struct FCreateBuildResult final
{
public:
	struct FGameLiftBuild                         Build;                                             // 0x0000(0x0078)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAwsCredentials                        UploadCredentials;                                 // 0x0078(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FS3Location                            StorageLocation;                                   // 0x00A8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.ResourceCreationLimitPolicy
// 0x0008 (0x0008 - 0x0000)
struct FResourceCreationLimitPolicy final
{
public:
	int32                                         NewGameSessionsPerCreator;                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PolicyPeriodInMinutes;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AwsGameLiftClient.CertificateConfiguration
// 0x0001 (0x0001 - 0x0000)
struct FCertificateConfiguration final
{
public:
