#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintJson

#include "Basic.hpp"

#include "BlueprintJson_structs.hpp"


namespace SDK::Params
{

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonObjectToJsonValue
// 0x0030 (0x0030 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonObjectToJsonValue final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonObjectToPrettyString
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonObjectToPrettyString final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonObjectToString
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonObjectToString final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonValueToArray
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonValueToArray final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FBlueprintJsonValue>            ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonValueToBool
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonValueToBool final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C36[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonValueToFloat
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonValueToFloat final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C37[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonValueToInteger
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonValueToInteger final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C38[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonValueToObject
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonValueToObject final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonObject                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_JsonValueToString
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_Conv_JsonValueToString final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.Conv_StringToJsonObject
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_Conv_StringToJsonObject final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintJsonObject                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.EquaEqual_JsonValue
// 0x0028 (0x0028 - 0x0000)
struct BlueprintJsonLibrary_EquaEqual_JsonValue final
{
public:
	struct FBlueprintJsonValue                    A;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    B;                                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C39[0x7];                                      // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonHasField
// 0x0028 (0x0028 - 0x0000)
struct BlueprintJsonLibrary_JsonHasField final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3A[0x7];                                      // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonHasTypedField
// 0x0028 (0x0028 - 0x0000)
struct BlueprintJsonLibrary_JsonHasTypedField final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJsonType                                     Type;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3B[0x6];                                      // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonIsNull
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_JsonIsNull final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3C[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMake
// 0x0010 (0x0010 - 0x0000)
struct BlueprintJsonLibrary_JsonMake final
{
public:
	struct FBlueprintJsonObject                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeArray
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeArray final
{
public:
	TArray<struct FBlueprintJsonValue>            Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeBool
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeBool final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3D[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeField
// 0x0040 (0x0040 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeField final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    Value;                                             // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonObject                   ReturnValue;                                       // 0x0030(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeFloat
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeFloat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3E[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeInt
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeInt final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3F[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeNull
// 0x0010 (0x0010 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeNull final
{
public:
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeObject
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeObject final
{
public:
	struct FBlueprintJsonObject                   Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonMakeString
// 0x0020 (0x0020 - 0x0000)
struct BlueprintJsonLibrary_JsonMakeString final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonRemoveField
// 0x0030 (0x0030 - 0x0000)
struct BlueprintJsonLibrary_JsonRemoveField final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintJsonObject                   ReturnValue;                                       // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonSetField
// 0x0040 (0x0040 - 0x0000)
struct BlueprintJsonLibrary_JsonSetField final
{
public:
	struct FBlueprintJsonObject                   JsonObject;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonObject                   ReturnValue;                                       // 0x0030(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BlueprintJson.BlueprintJsonLibrary.JsonType
// 0x0018 (0x0018 - 0x0000)
struct BlueprintJsonLibrary_JsonType final
{
public:
	struct FBlueprintJsonValue                    JsonValue;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EJsonType                                     ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C40[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintJson.BlueprintJsonLibrary.NotEqual_JsonValue
// 0x0028 (0x0028 - 0x0000)
struct BlueprintJsonLibrary_NotEqual_JsonValue final
{
public:
	struct FBlueprintJsonValue                    A;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintJsonValue                    B;                                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C41[0x7];                                      // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

