#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorWheelPlugin

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "ColorWheelPlugin_structs.hpp"


namespace SDK
{

// Class ColorWheelPlugin.ColorWheelHelper
// 0x0000 (0x0028 - 0x0028)
class UColorWheelHelper final : public UBlueprintFunctionLibrary
{
public:
	static class FString ByteToHex(uint8 Byte);
	static class FString ColorToHex(const struct FColor& Color);
	static struct FLinearColor GetColorUnderCursor();
	static uint8 HexToByte(const class FString& Hex);
	static struct FColor HexToColor(const class FString& Hex);
	static struct FLinearColor HexToLinearColor(const class FString& Hex);
	static class FString LinearColorToHex(const struct FLinearColor& Color, const bool IsSRGB);
	static struct FColor RandomColor(bool RandomAlpha, bool TrueRandom);
	static struct FLinearColor RandomLinearColor(bool RandomAlpha, bool TrueRandom);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorWheelHelper">();
	}
	static class UColorWheelHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorWheelHelper>();
	}
};

// Class ColorWheelPlugin.ColorWidget
// 0x0168 (0x0270 - 0x0108)
class UColorWidget final : public UWidget
{
public:
	struct FSlateBrush                            SelectorPin;                                       // 0x0108(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HueCircle;                                         // 0x0190(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnColorChanged;                                    // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMouseDown;                                       // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMouseUp;                                         // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1043[0x28];                                    // 0x0248(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FLinearColor GetCurrentColor();
	void SetColor(const struct FLinearColor& NewColor);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity, EWheelBrushTarget Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorWidget">();
	}
	static class UColorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorWidget>();
	}
};

}

