#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomTeam

#include "Basic.hpp"

#include "TeamInfo_structs.hpp"
#include "SP_TeamAppearance_structs.hpp"


namespace SDK
{

// UserDefinedStruct CustomTeam.CustomTeam
// 0x03F0 (0x03F0 - 0x0000)
struct FCustomTeam final
{
public:
	struct FTeamInfo                              TeamInfo_14_97202B0344F4B4BDC39D4487C643EAB5;      // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     HomeKit_16_0723B4774D632A6C2C381EB482610348;       // 0x0030(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     HomeGK_17_D0165B8A45197EEFDA3968BE9E5CA664;        // 0x00D0(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     AwayKit_19_4780BCBB48EF9F3185DA77AC71916E37;       // 0x0170(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     AwayGK_21_5671F6E24134733A3175AE972D8E7301;        // 0x0210(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     AltKit_23_27665B924CD8A1EDBC5274A1979BBAFC;        // 0x02B0(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     AltGK_25_EB545133465B1B5498E139BF885DEB4F;         // 0x0350(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

