#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DS_EntryGameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DS_EntryGameMode.DS_EntryGameMode_C
// 0x0040 (0x0300 - 0x02C0)
class ADS_EntryGameMode_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ADS_Entry_GameState_C*                  DS_Entry_GameState;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    PSO_GameInstance;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 StartingLevel;                                     // 0x02E0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 LeavingPlayerName;                                 // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DS_EntryGameMode(int32 EntryPoint);
	void ReceiveBeginPlay();
	void AWSGamelift_Initialize();
	void OpenLevel(class FName LevelName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DS_EntryGameMode_C">();
	}
	static class ADS_EntryGameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADS_EntryGameMode_C>();
	}
};

}

