#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkMovieScene

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "LiveLinkMovieScene_structs.hpp"


namespace SDK
{

// Class LiveLinkMovieScene.MovieSceneLiveLinkSection
// 0x0140 (0x0228 - 0x00E8)
class UMovieSceneLiveLinkSection final : public UMovieSceneSection
{
public:
	struct FLiveLinkSubjectPreset                 SubjectPreset;                                     // 0x00E8(0x0038)(NoDestructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  ChannelMask;                                       // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneLiveLinkSubSection*>  SubSections;                                       // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A81[0x10];                                    // 0x0140(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SubjectName;                                       // 0x0150(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkFrameData                     TemplateToPush;                                    // 0x0158(0x0090)(Deprecated, NativeAccessSpecifierPublic)
	struct FLiveLinkRefSkeleton                   RefSkeleton;                                       // 0x01E8(0x0020)(Deprecated, NativeAccessSpecifierPublic)
	TArray<class FName>                           CurveNames;                                        // 0x0208(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneFloatChannel>        PropertyFloatChannels;                             // 0x0218(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSection">();
	}
	static class UMovieSceneLiveLinkSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSection>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSection
// 0x0028 (0x0050 - 0x0028)
class UMovieSceneLiveLinkSubSection : public UObject
{
public:
	struct FLiveLinkSubSectionData                SubSectionData;                                    // 0x0028(0x0010)(NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkRole>              SubjectRole;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A82[0x10];                                    // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSection">();
	}
	static class UMovieSceneLiveLinkSubSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSection>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSectionAnimation
// 0x0010 (0x0060 - 0x0050)
class UMovieSceneLiveLinkSubSectionAnimation final : public UMovieSceneLiveLinkSubSection
{
public:
	uint8                                         Pad_1A83[0x10];                                    // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSectionAnimation">();
	}
	static class UMovieSceneLiveLinkSubSectionAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSectionAnimation>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSectionBasicRole
// 0x0010 (0x0060 - 0x0050)
class UMovieSceneLiveLinkSubSectionBasicRole final : public UMovieSceneLiveLinkSubSection
{
public:
	uint8                                         Pad_1A84[0x10];                                    // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSectionBasicRole">();
	}
	static class UMovieSceneLiveLinkSubSectionBasicRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSectionBasicRole>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSectionProperties
// 0x0010 (0x0060 - 0x0050)
class UMovieSceneLiveLinkSubSectionProperties final : public UMovieSceneLiveLinkSubSection
{
public:
	uint8                                         Pad_1A85[0x10];                                    // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSectionProperties">();
	}
	static class UMovieSceneLiveLinkSubSectionProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSectionProperties>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkTrack
// 0x0010 (0x00D0 - 0x00C0)
class UMovieSceneLiveLinkTrack final : public UMovieScenePropertyTrack
{
public:
	uint8                                         Pad_1A86[0x8];                                     // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULiveLinkRole>              TrackRole;                                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkTrack">();
	}
	static class UMovieSceneLiveLinkTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkTrack>();
	}
};

}

