#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkInterface

#include "Basic.hpp"

#include "LiveLinkInterface_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LiveLinkInterface.LiveLinkSourceFactory
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkSourceFactory : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkSourceFactory">();
	}
	static class ULiveLinkSourceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkSourceFactory>();
	}
};

// Class LiveLinkInterface.LiveLinkRole
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkRole : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkRole">();
	}
	static class ULiveLinkRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkRole>();
	}
};

// Class LiveLinkInterface.LiveLinkBasicRole
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkBasicRole : public ULiveLinkRole
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkBasicRole">();
	}
	static class ULiveLinkBasicRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkBasicRole>();
	}
};

// Class LiveLinkInterface.LiveLinkTransformRole
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkTransformRole : public ULiveLinkBasicRole
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkTransformRole">();
	}
	static class ULiveLinkTransformRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkTransformRole>();
	}
};

// Class LiveLinkInterface.LiveLinkCameraRole
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkCameraRole final : public ULiveLinkTransformRole
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkCameraRole">();
	}
	static class ULiveLinkCameraRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkCameraRole>();
	}
};

// Class LiveLinkInterface.LiveLinkFrameInterpolationProcessor
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkFrameInterpolationProcessor : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkFrameInterpolationProcessor">();
	}
	static class ULiveLinkFrameInterpolationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkFrameInterpolationProcessor>();
	}
};

// Class LiveLinkInterface.LiveLinkFrameTranslator
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkFrameTranslator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkFrameTranslator">();
	}
	static class ULiveLinkFrameTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkFrameTranslator>();
	}
};

// Class LiveLinkInterface.LiveLinkVirtualSubject
// 0x0138 (0x0160 - 0x0028)
class ULiveLinkVirtualSubject : public UObject
{
public:
	uint8                                         Pad_1A41[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULiveLinkRole>              Role;                                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FLiveLinkSubjectName>           Subjects;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ULiveLinkFrameTranslator*>       FrameTranslators;                                  // 0x0048(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bRebroadcastSubject;                               // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A42[0x107];                                   // 0x0059(0x0107)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkVirtualSubject">();
	}
	static class ULiveLinkVirtualSubject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkVirtualSubject>();
	}
};

// Class LiveLinkInterface.LiveLinkFramePreProcessor
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkFramePreProcessor : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkFramePreProcessor">();
	}
	static class ULiveLinkFramePreProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkFramePreProcessor>();
	}
};

// Class LiveLinkInterface.LiveLinkSourceSettings
// 0x0078 (0x00A0 - 0x0028)
class ULiveLinkSourceSettings : public UObject
{
public:
	ELiveLinkSourceMode                           Mode;                                              // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A43[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLiveLinkSourceBufferManagementSettings BufferSettings;                                    // 0x0030(0x0058)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ConnectionString;                                  // 0x0088(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkSourceFactory>     Factory;                                           // 0x0098(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkSourceSettings">();
	}
	static class ULiveLinkSourceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkSourceSettings>();
	}
};

// Class LiveLinkInterface.LiveLinkAnimationRole
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkAnimationRole final : public ULiveLinkBasicRole
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkAnimationRole">();
	}
	static class ULiveLinkAnimationRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkAnimationRole>();
	}
};

// Class LiveLinkInterface.LiveLinkController
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkController final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkController">();
	}
	static class ULiveLinkController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkController>();
	}
};

// Class LiveLinkInterface.LiveLinkCurveRemapSettings
// 0x0050 (0x00F0 - 0x00A0)
class ULiveLinkCurveRemapSettings final : public ULiveLinkSourceSettings
{
public:
	struct FLiveLinkCurveConversionSettings       CurveConversionSettings;                           // 0x00A0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkCurveRemapSettings">();
	}
	static class ULiveLinkCurveRemapSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkCurveRemapSettings>();
	}
};

// Class LiveLinkInterface.LiveLinkLightRole
// 0x0000 (0x0028 - 0x0028)
class ULiveLinkLightRole final : public ULiveLinkTransformRole
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkLightRole">();
	}
	static class ULiveLinkLightRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkLightRole>();
	}
};

// Class LiveLinkInterface.LiveLinkSubjectSettings
// 0x0040 (0x0068 - 0x0028)
class ULiveLinkSubjectSettings final : public UObject
{
public:
	TArray<class ULiveLinkFramePreProcessor*>     PreProcessors;                                     // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class ULiveLinkFrameInterpolationProcessor*   InterpolationProcessor;                            // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULiveLinkFrameTranslator*>       Translators;                                       // 0x0040(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkRole>              Role;                                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             FrameRate;                                         // 0x0058(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRebroadcastSubject;                               // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A44[0x7];                                     // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkSubjectSettings">();
	}
	static class ULiveLinkSubjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkSubjectSettings>();
	}
};

}

