#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_Character

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SP_PlayerAppearance_structs.hpp"
#include "SP_TeamAppearance_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_Character.MM_Character_C
// 0x0800 (0x0CC0 - 0x04C0)
class AMM_Character_C final : public ACharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       ShirtData;                                         // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FacialHair;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair;                                              // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shoes;                                             // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Socks;                                             // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shorts;                                            // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wristbands;                                        // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Gloves;                                            // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shirt;                                             // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       MainMenuCamera;                                    // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       IntroCamera;                                       // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ball;                                              // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraMoving;                                      // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_204B[0x7];                                     // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FLinearColor>              SP_EyeColor;                                       // 0x0530(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_HairStyle;                                      // 0x0580(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_HairTexture;                                    // 0x05D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_FacialHairStyle;                                // 0x0620(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_FacialHairTexture;                              // 0x0670(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_ShirtStyle;                                     // 0x06C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_ShirtPatterns;                                  // 0x0710(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_ShortsStyles;                                   // 0x0760(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_ShortsPatternsMid;                              // 0x07B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_ShortsPatternsLow;                              // 0x0800(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_ShortsPatternsHigh;                             // 0x0850(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_SocksStyles;                                    // 0x08A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_SocksPatternsMid;                               // 0x08F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_SocksPatternsHigh;                              // 0x0940(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_SocksPatternsLow;                               // 0x0990(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_ShoesDIF;                                       // 0x09E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UTexture*>                  SP_ShoesNRM;                                       // 0x0A30(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_GlovesStyle;                                    // 0x0A80(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USkeletalMesh*>             SP_WristBandsStyle;                                // 0x0AD0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSP_PlayerAppearance                   SP_PlayerAppearance;                               // 0x0B20(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     SP_TeamAppearance;                                 // 0x0BC8(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<int32, class UMaterial*>                 BallDesign;                                        // 0x0C68(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         RotationState;                                     // 0x0CB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_Character(int32 EntryPoint);
	void CheckRotationState();
	void StartPlayerRotationTimer();
	void EnterCustomizationView();
	void EnterDefaultView();
	void EnterPanelView();
	void EnterMainMenuView();
	void Camera_ShoeView();
	void Camera_BallView();
	void ReceiveBeginPlay();
	void Camera_FaceView();
	void Camera_CustomizationView();
	void UpdateBallStyle(int32 Param_BallDesign);
	void ApplySP_Appearance();
	void UpdateHairAppearance(int32 HairStyle, const struct FLinearColor& HairColor);
	void UpdateShoesAppearance(int32 ShoeStyle);
	void UpdateSocksAppearance(const int32& SocksStyle, int32 BodySize, int32 ShoeStyle, const int32& SocksPattern, const struct FLinearColor& Color1, const struct FLinearColor& Color2);
	void UpdateShortsAppearance(const int32& ShortsStyle, int32 BodySize, float SkinTone, const int32& ShortsPattern, const struct FLinearColor& Color1, const struct FLinearColor& Color2);
	void UpdateFacialHairAppearance(int32 FacialHairStyle, const struct FLinearColor& FacialHairColor);
	void UpdateHeadAppearance(int32 HeadType, int32 BodySize, float SkinTone, const int32& EyeColor, int32 HairStyle, const struct FLinearColor& HairColor, int32 FacialHairStyle, const struct FLinearColor& FacialHairColor);
	void RecieveSP_PlayerAppearance(const struct FSP_PlayerAppearance& Param_SP_PlayerAppearance);
	void UpdateGlovesAppearance(int32 Param_Gloves, const struct FLinearColor& Color);
	void RecieveSP_TeamAppearance(const struct FSP_TeamAppearance& Param_SP_TeamAppearance);
	void RecieveSP_AppearanceCombined(const struct FSP_PlayerAppearance& Param_SP_PlayerAppearance, const struct FSP_TeamAppearance& Param_SP_TeamAppearance);
	void UpdateShirtAppearance(int32 ShirtStyle, bool ShirtTuckedIn_, int32 BodySize, float SkinTone, const int32& ShirtPattern, const struct FLinearColor& ShirtColor1, const struct FLinearColor& ShirtColor2, const class FText& PlayerName, const class FText& PlayerNumber, int32 ShirtFontStyle, const struct FSlateColor& ShirtFontColor, int32 ShiftFontFrontNumber);
	void UpdateWristbandsAppearance(int32 Param_Wristbands, const struct FLinearColor& Color);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_Character_C">();
	}
	static class AMM_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_Character_C>();
	}
};

}

