#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiplayerMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MultiplayerMenu.MultiplayerMenu_C
// 0x0218 (0x0478 - 0x0260)
class UMultiplayerMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GoalStateNoAssistFadeIn_Out;                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoalStateAssistFadeIn_Out;                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MatchStateFadeIn_Out;                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChat_C*                                Chat;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseMatchSummary;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCPTMenu_C*                             CPTMenu;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CPTMenuButton;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Exit;                                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Exit_1;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExitBG;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitNo;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitPanelBG;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ExitScreen;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ExitTextNo;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ExitTextYes;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitYes;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExportMatchStatsButton;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHostMenu_C*                            HostMenu;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HostMenuButton;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LightBackground;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LobbyNameText;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchInfo_C*                           MatchInfo;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MatchInfoButton;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchState_C*                          MatchState;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MenuButtons;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MenuSwitcher;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerReport_C*                        PlayerReport;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayersText;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Resume;                                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScorecard_C*                           Scorecard;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SettingsButton;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettings_C*                            SettingsMenu;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USP_EmotesPlusQC_C*                     SP_EmotesPlusQC;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USP_KickBar_C*                          SP_KickBar;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpectatorOptions_C*                    SpectatorOptions;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStats_C*                         T1PlayerStats;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                T1StatsButton;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             T1StatsText;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStats_C*                         T2PlayerStats;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                T2StatsButton;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             T2StatsText;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TopRightButtons;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TopRightButtons_1;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVotePanel_C*                           VotePanel;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    PSO_GameInstance;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASP_Controller_C*                       SP_Controller;                                     // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMP_HUD_NEW_C*                          MP_HUD;                                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AMP_GameState_C*                        MP_GameState;                                      // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerCount;                                       // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214D[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int32>                            MatchMinutesComboBoxMap;                           // 0x03F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InMatchSummary;                                    // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_214E[0x3];                                     // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         T1RedCardCount;                                    // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         T2RedCardCount;                                    // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         T1CoachCount;                                      // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         T2CoachCount;                                      // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214F[0x4];                                     // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ExportStatsText;                                   // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MultiplayerMenu(int32 EntryPoint);
	void BndEvt__MultiplayerMenu_ExportMatchStatsButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void ExportMatchStats();
	void GoalStateFadeIn(const class FText& TeamScoreText, const struct FLinearColor& TeamScoreTextColor, bool WithAssist_, const class FText& ScorerName, const class FText& AssisterName);
	void UpdateMatchState();
	void MatchStateSetText(const class FText& InText, const struct FLinearColor& InColor);
	void MatchStateFadeOut();
	void MatchStateFadeIn(const class FText& InText, const struct FLinearColor& InColor);
	void UpdateCPTFormationItem(class UTeamFormationItem_C* PlayerStatsItem, class AMP_PlayerState_C* MP_PlayerState);
	void CreateCPTPlayerListItem(int32 PositionIndex);
	void CaptainPlayerListItems_T2();
	void UpdateCPTListItem(class UCPTMenuPlayerItem_C* ListItem, class AMP_PlayerState_C* MP_PlayerState);
	void CaptainPlayerListItems_T1();
	void CaptainPlayerList();
	void UpdateFormationItem(class UTeamFormationItem_C* PlayerStatsItem, class AMP_PlayerState_C* MP_PlayerState);
	void UpdateStatsItem(class UPlayerStatsItem_C* PlayerStatsItem, class AMP_PlayerState_C* MP_PlayerState);
	void UpdateTeamListItem(class UTeamListItem_C* ListItem, class AMP_PlayerState_C* MP_PlayerState);
	void OpenMatchSummary();
	void BndEvt__MultiplayerMenu_CloseMatchSummary_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void UpdateMatchSummary();
	void BndEvt__MultiplayerMenu_Exit_1_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void StartUpdateMultiplayerMenuLoop();
	void CreateChatMessage(const class FString& Message);
	void BndEvt__MultiplayerMenu_Exit_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MultiplayerMenu_ExitNo_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MultiplayerMenu_ExitYes_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void RefreshCPTFormation();
	void CreateCPTFormationItem(int32 Param_Index);
	void UpdateVotePanel();
	void BndEvt__MultiplayerMenu_Settings_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MultiplayerMenu_Resume_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void AllChatPressed();
	void TeamChatPressed();
	void RecieveChatMessage(int32 MessageType, const class FString& SenderSteamID, int32 Team, const class FString& MessageGroup, const class FString& PlayerName, int32 Position, const class FString& Message, const class FString& SwappingPlayerName, int32 SwappingPlayerTeam, int32 SwappingPlayerPosition);
	void RefreshHostMenuPlayerList();
	void CreateHostListItems();
	void UpdateLobbyInfo();
	void UpdateHostMenu();
	void UpdateCPTMenu();
	void UpdateScorecard();
	void UpdateMatchSettings();
	void UpdateTeamStats();
	void CreateT2PlayerStatsItems(int32 PositionIndex);
	void CreateT1PlayerStatsItems(int32 PositionIndex);
	void UpdateTeamInfo();
	void RefreshSpectatorsList();
	void CreateT2FormationItem(int32 Param_Index);
	void RefreshT2Formation();
	void RefreshT1Formation();
	void CreateT1FormationItem(int32 Param_Index);
	void CreateSpectatorItem();
	void RefreshT2List_PlayerStats();
	void UpdatePlayers();
	void CloseMultiplayerMenu();
	void OpenMultiplayerMenu();
	void BndEvt__MatchMenu_T2StatsButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MatchMenu_T1StatsButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MatchMenu_MatchInfoButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MatchMenu_CPTMenuButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MatchMenu_HostMenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void CreateT2ListItems(int32 Param_Index);
	void CreateT1ListItems(int32 Param_Index);
	void UpdateMultiplayerMenu();
	void RefreshT1List_PlayerStats();
	void CreateMenuItems();
	void Initialize();
	void Construct();
	void CalculateTeam1PositionText(int32 PositionIndex, class FText* Position);
	void CalculateTeam1OccupiedButtonStyle(struct FComboBoxStyle* ComboBoxStyle);
	void CalculateTeam1AvailableButtonStyle(struct FButtonStyle* ButtonStyle);
	void CalculateTeam1FormationButtonStyle(struct FButtonStyle* ButtonStyle);
	void CalculateTeam2PositionText(int32 PositionIndex, class FText* Position);
	void CalculateTeam2OccupiedButtonStyle(struct FComboBoxStyle* ComboBoxStyle);
	void CalculateTeam2AvailableButtonStyle(struct FButtonStyle* ButtonStyle);
	void CalculateTeam2FormationButtonStyle(struct FButtonStyle* ButtonStyle);
	void CalculateTeam1CaptainButtonEnabled(bool* Enabled, class FString* Option);
	void CalculateTeam2CaptainButtonEnabled(bool* Enabled, class FString* Option);
	void CalculateCaptainFormationSelections(TArray<struct FTeamFormation>* Formation);
	void CalculateMessage(int32 MessageType, const class FString& SteamID, int32 Team, const class FString& MessageGroup, const class FString& PlayerName, int32 Position, const class FString& Message, int32 SwappingPlayerTeam, const class FString& SwappingPlayerName, int32 SwappingPlayerPosition, bool* SendMessage_, class FString* MessageOut);
	void CalculatePersonVoteText(class FText* PersonalVoteText1, class FText* PersonalVoteText2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MultiplayerMenu_C">();
	}
	static class UMultiplayerMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiplayerMenu_C>();
	}
};

}

