#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsPanel

#include "Basic.hpp"

#include "BlueprintJson_structs.hpp"


namespace SDK::Params
{

// Function NewsPanel.NewsPanel_C.ExecuteUbergraph_NewsPanel
// 0x00E0 (0x00E0 - 0x0000)
struct NewsPanel_C_ExecuteUbergraph_NewsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FDB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_NewsItemString;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintJsonObject                   CallFunc_Conv_StringToJsonObject_ReturnValue;      // 0x0018(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_Conv_JsonObjectToJsonValue_ReturnValue;   // 0x0028(0x0010)()
	struct FBlueprintJsonValue                    CallFunc_Conv_JsonObjectToJsonValue_ReturnValue_1; // 0x0038(0x0010)()
	class FString                                 CallFunc_Conv_JsonValueToString_ReturnValue;       // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_JsonValueToString_ReturnValue_1;     // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	struct FBlueprintJsonValue                    CallFunc_Conv_JsonObjectToJsonValue_ReturnValue_2; // 0x00A8(0x0010)()
	class FString                                 CallFunc_Conv_JsonValueToString_ReturnValue_2;     // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00C8(0x0018)()
};

// Function NewsPanel.NewsPanel_C.RecieveNewsStory
// 0x0010 (0x0010 - 0x0000)
struct NewsPanel_C_RecieveNewsStory final
{
public:
	class FString                                 NewsItemString;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

}

