#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenXRHandTracking

#include "Basic.hpp"

#include "LiveLinkInterface_classes.hpp"
#include "OpenXRHandTracking_structs.hpp"
#include "LiveLink_classes.hpp"


namespace SDK
{

// Class OpenXRHandTracking.LiveLinkOpenXRHandTrackingSourceFactory
// 0x0010 (0x0038 - 0x0028)
class ULiveLinkOpenXRHandTrackingSourceFactory final : public ULiveLinkSourceFactory
{
public:
	uint8                                         Pad_1A45[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkOpenXRHandTrackingSourceFactory">();
	}
	static class ULiveLinkOpenXRHandTrackingSourceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkOpenXRHandTrackingSourceFactory>();
	}
};

// Class OpenXRHandTracking.OpenXRHandTrackingLiveLinkRemapAsset
// 0x0058 (0x0080 - 0x0028)
class UOpenXRHandTrackingLiveLinkRemapAsset final : public ULiveLinkRetargetAsset
{
public:
	bool                                          bHasMetacarpals;                                   // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetargetRotationOnly;                             // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleX;                                          // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleY;                                          // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleZ;                                          // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleW;                                          // 0x002D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A46[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                HandTrackingBoneNameMap;                           // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpenXRHandTrackingLiveLinkRemapAsset">();
	}
	static class UOpenXRHandTrackingLiveLinkRemapAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenXRHandTrackingLiveLinkRemapAsset>();
	}
};

}

