#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSO_GameInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SP_PlayerAppearance_structs.hpp"
#include "CustomTeam_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PSO_GameInstance.PSO_GameInstance_C
// 0x0680 (0x0828 - 0x01A8)
class UPSO_GameInstance_C final : public UGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 CurrentVersion;                                    // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          OnestTimeLoading;                                  // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E94[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SteamID;                                           // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 UserId;                                            // 0x01D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         LookSensitivity;                                   // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightSensitivity;                                 // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurveSensitivity;                                  // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SoundEffectsVolume;                                // 0x0204(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmbientVolume;                                     // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MusicVolume;                                       // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VoiceChatVolume;                                   // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnestPersonFOV;                                    // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThreerdPersonFOV;                                  // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThreerdPersonDistance;                             // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThreerdPersonHeight;                               // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BallIndicatorSize;                                 // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GkNetTransparency;                                 // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayType;                                       // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentDisplayType;                                // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FullscreenResolution;                              // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 FullscreenCommand;                                 // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         RenderResolution;                                  // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FPS_Limit;                                         // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextureQuality;                                    // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShadowQuality;                                     // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FoliageQuality;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectsQuality;                                    // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AntiAliasingQuality;                               // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PostProcessingQuality;                             // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewDistance;                                      // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E95[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreferredRegion;                                   // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         TextChatMode;                                      // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProfanityFilter;                                   // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E96[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SteamEncryptedAppTicket;                           // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         PlayerLevel;                                       // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemainingXP;                                       // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextLevelXP;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousLevelXP;                                   // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LevelCompleted_;                                   // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E97[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMP_GameliftServerObject_C*             MP_GameliftServerObject;                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 GameSessionID;                                     // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 GameSessionName;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 GameSessionMode;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 HostId;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          InvertYLook;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InvertXLook;                                       // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangedInputKey;                                   // 0x02FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ToggleGkCatch;                                     // 0x02FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         GkDiveButton;                                      // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerCoins;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E98[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerSessionId;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsCustomLobbyHost;                                 // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E99[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MutedPlayers;                                      // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxPlayers;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9A[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class FString>                    ServerAliases;                                     // 0x0338(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSP_PlayerAppearance                   SP_PlayerAppearance;                               // 0x0388(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FCustomTeam                            CustomTeam;                                        // 0x0430(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     VaRestRequest;                                     // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PSO_GameInstance(int32 EntryPoint);
	void TwondAppTicketLoop();
	void InitialAppTicketLoop();
	void StartAppTicketLoop();
	void RefreshAppTicket();
	void UpdateSteamNameSuccess(class UVaRestRequestJSON* Request);
	void UpdateSteamNameFail(class UVaRestRequestJSON* Request);
	void Save_PSO_PlayerAppearance(const struct FSP_PlayerAppearance& Param_SP_PlayerAppearance);
	void Load_PSO_PlayerAppearance();
	void Save_PSO_CustomTeam(const struct FCustomTeam& Param_CustomTeam);
	void Load_PSO_CustomTeam();
	void StartNetProfiler();
	void CheckAchievements_All(int32 GoalsThisGame);
	void CheckAchievements_Saves(int32 Saves);
	void CheckAchievements_Wins(int32 Wins);
	void INTs(int32 Param_INTs);
	void CheckAchievements_Matches(int32 Matches);
	void CheckAchievements_Assists(int32 Assists);
	void CheckAchievements_Goals(int32 Goals, int32 GoalsThisGame);
	void CheckAchievements_Passes(int32 Passes);
	void Login(class UIntro_C* IntroMenu, int32 LoginType);
	void Set_RandomPSID();
	void ReceiveShutdown();
	void ReceiveInit();
	void CheckVoteNoKeys();
	void CheckVoteYesKeys();
	void CheckHorizontalAim();
	void CheckVerticalAim();
	void CheckTabKeys();
	void CheckEscapeKeys();
	void ResetKeyBinds();
	void CheckPushToTalkKeys();
	void CheckAllChatKeys();
	void CheckTeamChatKeys();
	void CheckQuickChat4Keys();
	void CheckQuickChat3Keys();
	void CheckQuickChat2Keys();
	void CheckQuickChat1Keys();
	void CheckEmoteKeys();
	void CheckSpawnBallKeys();
	void CheckToggleCameraKeys();
	void CheckGkButtonKeys();
	void CheckSlideTackleKeys();
	void CheckJuggleKeys();
	void CheckDribbleKeys();
	void CheckKickKeys();
	void CheckJumpKeys();
	void CheckSprintKeys();
	void CheckHorizontalMovementKeys();
	void CheckVerticalMovementKeys();
	void CheckKeybinds();
	void Apply_FoliageQuality();
	void Update_SettingsListItems();
	void Save_SettingsMinusOnline(const class FString& Param_PreferredRegion, int32 Param_TextChatMode, bool Param_ProfanityFilter, const TArray<class FString>& MutePlayers);
	void Save_SettingsMinusCamera(float Param_OnestPersonFOV, float Param_ThreerdPersonFOV, float Param_ThreerdPersonDistance, float Param_ThreerdPersonHeight, int32 Param_BallIndicatorSize, float Param_GkNetTransparency);
	void Save_SettingsMinusVideo(int32 Param_DisplayType, int32 Param_FullscreenResolution, float Param_RenderResolution, int32 Param_FPS_Limit, int32 Param_TextureQuality, int32 Param_ShadowQuality, int32 Param_FoliageQuality, int32 Param_EffectsQuality, int32 Param_AntiAliasingQuality, int32 Param_PostProcessingQuality, int32 Param_ViewDistance);
	void Save_SettingsMinusAudio(float Param_SoundEffectsVolume, float Param_AmbientVolume, float Param_MusicVolume, float Param_VoiceChatVolume);
	void Save_SettingsMinusControls(float Param_LookSensitivity, float Param_HeightSensitivity, float Param_CurveSensitivity, bool Param_InvertYLook, bool Param_InvertXLook, bool Param_ToggleGkCatch, int32 Param_GkDiveButton);
	void Load_Settings();
	void UpdateOnlineSettings();
	void Load_SettingsMinusOnline();
	void UpdateCameraSettings();
	void Load_SettingsMinusCamera();
	void Load_SettingsMinusVideo();
	void UpdateControlSettings();
	void Load_SettingsMinusAudio();
	void Load_SettingsMinusControls();
	void Borderless();
	void Apply_FullscreenResolution();
	void UpdateAudioSettings();
	void Apply_FPS_Limit();
	void Apply_PostProcessingQuality();
	void Apply_AntiAliasingQuality();
	void Apply_EffectsQuality();
	void Apply_ShadowQuality();
	void Apply_ViewDistance();
	void Apply_TextureQuality();
	void Apply_RenderResolution();
	void Apply_DisplayType();
	void GameliftServer_SetHostID(const class FString& Param_HostId);
	void GameliftServer_EC2Initialize(class ADS_EntryGameMode_C* DS_Entry_GameMode);
	void GameliftServer_SetMaxPlayers(int32 Param_MaxPlayers);
	void GameliftServer_SetSessionName(const class FString& SessionName);
	void GameliftServer_SetGameSessionID(const class FString& Param_GameSessionID);
	void GameliftServer_SetGameMode(const class FString& GameMode);
	void GameliftServer_Shutdown();
	void GameliftServer_Initialize(class ADS_EntryGameMode_C* DS_EntryGameMode);
	void OnCallback_E3B6E41E4CD5C53640E4A085DB144151(const struct FEncryptedAppTicketResponse& Data, bool bWasSuccessful);
	void CalculatePlayerLevel(int32 PlayersTotalXP, int32* Param_PlayerLevel, float* Param_LevelCompleted_);
	void CalculateXPToNextLevel(int32 Level, int32* Param_NextLevelXP, int32* Param_PreviousLevelXP);
	void CheckStringProfanity(const class FString& InputMessage, class FString* OutputMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PSO_GameInstance_C">();
	}
	static class UPSO_GameInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSO_GameInstance_C>();
	}
};

}

