#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSO_SettingsMinusOnline

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PSO_Settings-Online.PSO_Settings-Online_C
// 0x0030 (0x0058 - 0x0028)
class UPSO_SettingsMinusOnline_C final : public USaveGame
{
public:
	int32                                         TextChatMode;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SR_PreferredMode;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProfanityFilter;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D6[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreferredRegion;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         MutedPlayers;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PSO_Settings-Online_C">();
	}
	static class UPSO_SettingsMinusOnline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSO_SettingsMinusOnline_C>();
	}
};

}

