#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCUE4

#include "Basic.hpp"

#include "SCUE4_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeBool
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeByte
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeFloat
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeInt
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeName
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeString
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeText
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeBool
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17B8[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeBoolWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeBoolWithKey final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17B9[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeByte
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17BA[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeByteWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeByteWithKey final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17BB[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeColor
// 0x00A8 (0x00A8 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeColor final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeColorWithKey
// 0x00B8 (0x00B8 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeColorWithKey final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x00A8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeFloat
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17BC[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeFloatWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeFloatWithKey final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17BD[0x4];                                     // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeInt
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17BE[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeIntWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeIntWithKey final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17BF[0x4];                                     // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeName
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeNameWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeNameWithKey final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeRotator
// 0x0088 (0x0088 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeRotator final
{
public:
	struct FSafeRotator                           SR;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0078(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C0[0x4];                                     // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeRotatorWithKey
// 0x0098 (0x0098 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeRotatorWithKey final
{
public:
	struct FSafeRotator                           SR;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0088(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C1[0x4];                                     // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeString
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeStringWithKey
// 0x0058 (0x0058 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeStringWithKey final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeText
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeTextWithKey
// 0x0060 (0x0060 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeTextWithKey final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeTransform
// 0x01A0 (0x01A0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeTransform final
{
public:
	struct FSafeTransform                         ST;                                                // 0x0000(0x0168)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C2[0x8];                                     // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0170(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeTransformWithKey
// 0x01B0 (0x01B0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeTransformWithKey final
{
public:
	struct FSafeTransform                         ST;                                                // 0x0000(0x0168)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0168(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C3[0x8];                                     // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0180(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector2D
// 0x0060 (0x0060 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector2D final
{
public:
	struct FSafeVector2D                          SV;                                                // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector2DWithKey
// 0x0070 (0x0070 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector2DWithKey final
{
public:
	struct FSafeVector2D                          SV;                                                // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector3D
// 0x0088 (0x0088 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector3D final
{
public:
	struct FSafeVector3D                          SV;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0078(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C4[0x4];                                     // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector3DWithKey
// 0x0098 (0x0098 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector3DWithKey final
{
public:
	struct FSafeVector3D                          SV;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0088(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C5[0x4];                                     // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector4D
// 0x00B0 (0x00B0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector4D final
{
public:
	struct FSafeVector4D                          SV;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C6[0x8];                                     // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ReturnValue;                                       // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector4DWithKey
// 0x00C0 (0x00C0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector4DWithKey final
{
public:
	struct FSafeVector4D                          SV;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C7[0x8];                                     // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ReturnValue;                                       // 0x00B0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeBool
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C8[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeByte
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C9[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeFloat
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17CA[0x4];                                     // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeInt
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17CB[0x4];                                     // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeName
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeString
// 0x0058 (0x0058 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeText
// 0x0060 (0x0060 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeBool
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17CC[0x6];                                     // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeBoolWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeBoolWithKey final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0048(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17CD[0x6];                                     // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeByte
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17CE[0x6];                                     // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeByteWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeByteWithKey final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0048(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17CF[0x6];                                     // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeColor
// 0x00B8 (0x00B8 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeColor final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x00A8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeColorWithKey
// 0x00C8 (0x00C8 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeColorWithKey final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x00A8(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x00B8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeFloat
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeFloatWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeFloatWithKey final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0048(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x004C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeInt
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeIntWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeIntWithKey final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0048(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x004C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeName
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Value;                                             // 0x0038(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeNameWithKey
// 0x0058 (0x0058 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeNameWithKey final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Value;                                             // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeRotator
// 0x0090 (0x0090 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeRotator final
{
public:
	struct FSafeRotator                           SR;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Value;                                             // 0x0078(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0084(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeRotatorWithKey
// 0x00A0 (0x00A0 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeRotatorWithKey final
{
public:
	struct FSafeRotator                           SR;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Value;                                             // 0x0088(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0094(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeString
// 0x0058 (0x0058 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeStringWithKey
// 0x0068 (0x0068 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeStringWithKey final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0058(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeText
// 0x0068 (0x0068 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Value;                                             // 0x0038(0x0018)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0050(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeTextWithKey
// 0x0078 (0x0078 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeTextWithKey final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Value;                                             // 0x0048(0x0018)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0060(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeTransform
// 0x01D0 (0x01D0 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeTransform final
{
public:
	struct FSafeTransform                         ST;                                                // 0x0000(0x0168)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D0[0x8];                                     // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Value;                                             // 0x0170(0x0030)(Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x01A0(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeTransformWithKey
// 0x01E0 (0x01E0 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeTransformWithKey final
{
public:
	struct FSafeTransform                         ST;                                                // 0x0000(0x0168)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0168(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D1[0x8];                                     // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Value;                                             // 0x0180(0x0030)(Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x01B0(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeVector2D
// 0x0068 (0x0068 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeVector2D final
{
public:
	struct FSafeVector2D                          SV;                                                // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Value;                                             // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeVector2DWithKey
// 0x0078 (0x0078 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeVector2DWithKey final
{
public:
	struct FSafeVector2D                          SV;                                                // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Value;                                             // 0x0068(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeVector3D
// 0x0090 (0x0090 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeVector3D final
{
public:
	struct FSafeVector3D                          SV;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0078(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0084(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeVector3DWithKey
// 0x00A0 (0x00A0 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeVector3DWithKey final
{
public:
	struct FSafeVector3D                          SV;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0088(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0094(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeVector4D
// 0x00C0 (0x00C0 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeVector4D final
{
public:
	struct FSafeVector4D                          SV;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D2[0x8];                                     // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Value;                                             // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ReturnValue;                                       // 0x00B0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeVector4DWithKey
// 0x00D0 (0x00D0 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeVector4DWithKey final
{
public:
	struct FSafeVector4D                          SV;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D3[0x8];                                     // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Value;                                             // 0x00B0(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ReturnValue;                                       // 0x00C0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Pure_GetSafeBool
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Pure_GetSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D4[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Pure_GetSafeBoolWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Pure_GetSafeBoolWithKey final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D5[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Pure_GetSafeByte
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Pure_GetSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D6[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Pure_GetSafeByteWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Pure_GetSafeByteWithKey final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D7[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SCUE4.SCLibrary.SCL_Pure_GetSafeColor
// 0x00A8 (0x00A8 - 0x0000)
struct SCLibrary_SCL_Pure_GetSafeColor final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SCUE4.SCLibrary.SCL_Pure_GetSafeColorWithKey
// 0x00B8 (0x00B8 - 0x0000)
struct SCLibrary_SCL_Pure_GetSafeColorWithKey final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
