#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Settings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Settings.Settings_C.ExecuteUbergraph_Settings
// 0x1400 (0x1400 - 0x0000)
struct Settings_C_ExecuteUbergraph_Settings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2267[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0050(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00D8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0100(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0128(0x0088)()
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x01C0(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01F8(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0280(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x02B8(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0340(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0368(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_4;                    // 0x0390(0x0088)()
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0428(0x0278)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x06A0(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x06C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_5;                    // 0x06D8(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x0760(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_7;                        // 0x0788(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_6;                    // 0x0798(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x0820(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_10;                   // 0x0848(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_7;                    // 0x0870(0x0088)()
	struct FMargin                                K2Node_MakeStruct_Margin_8;                        // 0x08F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x0908(0x0278)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_11;                   // 0x0B80(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_9;                        // 0x0BA8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_8;                    // 0x0BB8(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_12;                   // 0x0C40(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_10;                       // 0x0C68(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_9;                    // 0x0C78(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_13;                   // 0x0D00(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_14;                   // 0x0D28(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_10;                   // 0x0D50(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_15;                   // 0x0DD8(0x0028)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_2;                   // 0x0E00(0x0278)()
	struct FMargin                                K2Node_MakeStruct_Margin_11;                       // 0x1078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_11;                   // 0x1088(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_3;                   // 0x1110(0x0278)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x1388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2268[0x4];                                     // 0x138C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x1390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    K2Node_DynamicCast_AsPSO_Game_Instance;            // 0x1398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x13A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2269[0x7];                                     // 0x13A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x13A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x13B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x13B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x13C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x13C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USettingsListItem_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x13D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x13E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226A[0x4];                                     // 0x13E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USettingsListItem_C*                    CallFunc_Array_Get_Item;                           // 0x13E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x13F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x13F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x13F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

