#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListItem

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "VictoryBPLibrary_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SettingsListItem.SettingsListItem_C.ExecuteUbergraph_SettingsListItem
// 0x2AF8 (0x2AF8 - 0x0000)
struct SettingsListItem_C_ExecuteUbergraph_SettingsListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2699[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMainMenu_C*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269B[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_C*                            CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0088(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00F8(0x0070)(ConstParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269C[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey;            // 0x0170(0x0020)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269D[0x6];                                     // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269E[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269F[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_2;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_3;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InAxisName_1;                   // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AxisValue_1;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A0[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_ControllerKey_3;                // 0x01D8(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A1[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings;         // 0x01F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A2[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_1;                         // 0x0210(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A3[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0240(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A4[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_MakeStruct_InputChord;                      // 0x0260(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_InputChord_GetDisplayName_ReturnValue;    // 0x0280(0x0018)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_InActionName_1;                 // 0x029C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A5[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_ControllerKey_2;                // 0x02A8(0x0018)(HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x02C0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_2;                         // 0x02D8(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A6[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_1;         // 0x0308(0x0018)()
	struct FInputChord                            K2Node_MakeStruct_InputChord_1;                    // 0x0320(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A7[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_InputChord_GetDisplayName_ReturnValue_1;  // 0x0348(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A8[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InAxisName;                     // 0x0364(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AxisValue;                      // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_ControllerKey_1;                // 0x0370(0x0018)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_CustomEvent_NewKey_1;                       // 0x0388(0x0020)(ConstParm, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionName;                   // 0x03A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_ControllerKey;                  // 0x03B0(0x0018)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_CustomEvent_NewKey;                         // 0x03C8(0x0020)(ConstParm, HasGetValueTypeHash)
	class FText                                   CallFunc_InputChord_GetDisplayName_ReturnValue_2;  // 0x03E8(0x0018)()
	class FText                                   CallFunc_InputChord_GetDisplayName_ReturnValue_3;  // 0x0400(0x0018)()
	class FText                                   CallFunc_InputChord_GetDisplayName_ReturnValue_4;  // 0x0418(0x0018)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0430(0x0028)()
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping_1;         // 0x0458(0x0028)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_2;         // 0x0480(0x0018)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_3;         // 0x0498(0x0018)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_1;     // 0x04C0(0x0010)(ReferenceParm)
	struct FVictoryInput                          K2Node_MakeStruct_VictoryInput;                    // 0x04D0(0x0040)()
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_3;                         // 0x0510(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A9[0x3];                                     // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVictoryInput                          K2Node_MakeStruct_VictoryInput_1;                  // 0x0540(0x0040)()
	bool                                          CallFunc_VictoryReBindActionKey_ReturnValue;       // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AA[0x5];                                     // 0x0583(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_InputChord_GetDisplayName_ReturnValue_5;  // 0x0588(0x0018)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_4;         // 0x05A0(0x0018)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_5;         // 0x05B8(0x0018)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x05D0(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping_1;           // 0x05F8(0x0028)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_1;       // 0x0630(0x0010)(ReferenceParm)
	struct FVictoryInputAxis                      K2Node_MakeStruct_VictoryInputAxis;                // 0x0640(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AB[0x3];                                     // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0688(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x06A0(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_4;                 // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AC[0x3];                                     // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AD[0x7];                                     // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x06F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0708(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0748(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0788(0x0018)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AE[0x7];                                     // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x07A8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x07E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x0828(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_4;           // 0x0840(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0858(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0898(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_5;           // 0x08D8(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_6;           // 0x08F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0908(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0948(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_7;           // 0x0988(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_8;           // 0x09A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x09B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x09F8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_9;           // 0x0A38(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_10;          // 0x0A50(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x0A68(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0AA8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_11;          // 0x0AE8(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_12;          // 0x0B00(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x0B18(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x0B58(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_13;          // 0x0B98(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_14;          // 0x0BB0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_15;           // 0x0BC8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_16;           // 0x0C08(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_17;           // 0x0C48(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0C88(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0C98(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x0CB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26AF[0x4];                                     // 0x0CBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_18;           // 0x0CC0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0D00(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0D10(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_15;          // 0x0D28(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_19;           // 0x0D40(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_20;           // 0x0D80(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0DC0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_16;          // 0x0DD0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0DE8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_21;           // 0x0E00(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_22;           // 0x0E40(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_5;                 // 0x0E80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B0[0x7];                                     // 0x0E81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0E88(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0E98(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess_6;                 // 0x0EB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B1[0x3];                                     // 0x0EB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0EB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_4;                         // 0x0EB8(0x0028)()
	struct FVictoryInputAxis                      K2Node_MakeStruct_VictoryInputAxis_1;              // 0x0EE0(0x0040)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_VictoryReBindAxisKey_ReturnValue;         // 0x0F21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0F22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0F23(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0F24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_7;                 // 0x0F25(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_8;                 // 0x0F26(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B2[0x1];                                     // 0x0F27(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_5;                         // 0x0F28(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess_9;                 // 0x0F40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B3[0x7];                                     // 0x0F41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_6;                         // 0x0F48(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0F60(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0F88(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0FB0(0x0028)()
	class FText                                   CallFunc_Array_Get_Item_7;                         // 0x0FD8(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0FF0(0x0028)()
	class FText                                   CallFunc_Array_Get_Item_8;                         // 0x1018(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue_3;                   // 0x1030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_4;                   // 0x1034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_5;                   // 0x1038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_6;                   // 0x103C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_17;          // 0x1040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_23;           // 0x1058(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_24;           // 0x1098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x10D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_18;          // 0x10E8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x1100(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_25;           // 0x1118(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_26;           // 0x1158(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x1198(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_19;          // 0x11A8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x11C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_27;           // 0x11D8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_28;           // 0x1218(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x1258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_20;          // 0x1268(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x1280(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_29;           // 0x1298(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_30;           // 0x12D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x1318(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess_10;                // 0x1328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B4[0x7];                                     // 0x1329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x1330(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_9;                         // 0x1348(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_10;                        // 0x1360(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_11;                        // 0x1378(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_12;                        // 0x1390(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_13;                        // 0x13A8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_14;                        // 0x13C0(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_15;                        // 0x13D8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_16;                        // 0x13F0(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_17;                        // 0x1408(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue_7;                   // 0x1420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_8;                   // 0x1424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x1428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B5[0x4];                                     // 0x142C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_31;           // 0x1430(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x1470(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x1480(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_21;          // 0x1498(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_32;           // 0x14B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_33;           // 0x14F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_9;                          // 0x1530(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x1540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B6[0x4];                                     // 0x1544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_9;                     // 0x1548(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_22;          // 0x1560(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_34;           // 0x1578(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_35;           // 0x15B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_10;                         // 0x15F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_10;                    // 0x1608(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_36;           // 0x1620(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_11;                         // 0x1660(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_11;                    // 0x1670(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_37;           // 0x1688(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_12;                         // 0x16C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_12;                    // 0x16D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_38;           // 0x16F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_13;                         // 0x1730(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_13;                    // 0x1740(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_39;           // 0x1758(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_14;                         // 0x1798(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_14;                    // 0x17A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_40;           // 0x17C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_15;                         // 0x1800(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_15;                    // 0x1810(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_41;           // 0x1828(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_16;                         // 0x1868(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_16;                    // 0x1878(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_42;           // 0x1890(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_17;                         // 0x18D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_17;                    // 0x18E0(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_18;                        // 0x18F8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_19;                        // 0x1910(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_20;                        // 0x1928(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_43;           // 0x1940(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_21;                        // 0x1980(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_18;                         // 0x1998(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_18;                    // 0x19A8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_22;                        // 0x19C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_44;           // 0x19D8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_23;                        // 0x1A18(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_19;                         // 0x1A30(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_19;                    // 0x1A40(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_24;                        // 0x1A58(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_45;           // 0x1A70(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_46;           // 0x1AB0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_20;                         // 0x1AF0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_21;                         // 0x1B00(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_20;                    // 0x1B10(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_21;                    // 0x1B28(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_25;                        // 0x1B40(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_26;                        // 0x1B58(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_47;           // 0x1B70(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_22;                         // 0x1BB0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_22;                    // 0x1BC0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_48;           // 0x1BD8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_23;                         // 0x1C18(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_23;                    // 0x1C28(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue_9;                   // 0x1C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_10;                  // 0x1C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_11;                  // 0x1C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_12;                  // 0x1C4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_13;                  // 0x1C50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B7[0x4];                                     // 0x1C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_23;          // 0x1C58(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_49;           // 0x1C70(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_50;           // 0x1CB0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_24;                         // 0x1CF0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_24;          // 0x1D00(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_24;                    // 0x1D18(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_51;           // 0x1D30(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_52;           // 0x1D70(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_25;                         // 0x1DB0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_25;          // 0x1DC0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_25;                    // 0x1DD8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_53;           // 0x1DF0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x1E30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B8[0x7];                                     // 0x1E31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_26;          // 0x1E38(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_54;           // 0x1E50(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_55;           // 0x1E90(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_26;                         // 0x1ED0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_27;          // 0x1EE0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_26;                    // 0x1EF8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_56;           // 0x1F10(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x1F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B9[0x7];                                     // 0x1F51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_28;          // 0x1F58(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_57;           // 0x1F70(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_58;           // 0x1FB0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_27;                         // 0x1FF0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_29;          // 0x2000(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_27;                    // 0x2018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_59;           // 0x2030(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_60;           // 0x2070(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_61;           // 0x20B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_28;                         // 0x20F0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_29;                         // 0x2100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_28;                    // 0x2110(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_29;                    // 0x2128(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_62;           // 0x2140(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_30;                         // 0x2180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_30;                    // 0x2190(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_27;                        // 0x21A8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_28;                        // 0x21C0(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_29;                        // 0x21D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_63;           // 0x21F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_31;                         // 0x2230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_31;                    // 0x2240(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_30;                        // 0x2258(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_31;                        // 0x2270(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_32;                        // 0x2288(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x22A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x22A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x22A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x22AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x22B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x22B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x22B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x22BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_3;                      // 0x22C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x22C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_4;                      // 0x22C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x22CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_5;                      // 0x22D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x22D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_6;                      // 0x22D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_12;                // 0x22DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_7;                      // 0x22E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_13;                // 0x22E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_8;                      // 0x22E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_14;                // 0x22EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_9;                      // 0x22F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_15;                // 0x22F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_10;                     // 0x22F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x22FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26BA[0x3];                                     // 0x22FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_33;                        // 0x2300(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_34;                        // 0x2318(0x0018)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_4;           // 0x2330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_5;           // 0x2338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_6;           // 0x2340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_7;           // 0x2348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_8;           // 0x2350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_9;           // 0x2358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_10;          // 0x2360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_11;          // 0x2368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x2370(0x0028)()
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x2398(0x0058)(HasGetValueTypeHash)
	struct FTextBlockStyle                        K2Node_MakeStruct_TextBlockStyle;                  // 0x23F0(0x0270)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x2660(0x0028)()
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x2688(0x0058)(HasGetValueTypeHash)
	struct FTextBlockStyle                        K2Node_MakeStruct_TextBlockStyle_1;                // 0x26E0(0x0270)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x2950(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x2968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26BB[0x7];                                     // 0x2969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_1;               // 0x2970(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_1;          // 0x2988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26BC[0x7];                                     // 0x2989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_2;               // 0x2990(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_2;          // 0x29A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26BD[0x7];                                     // 0x29A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_3;               // 0x29B0(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_3;          // 0x29C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26BE[0x7];                                     // 0x29C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_4;               // 0x29D0(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue_4;          // 0x29E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26BF[0x7];                                     // 0x29E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_5;               // 0x29F0(0x0018)()
