#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_AppearanceCombined

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SP_AppearanceCombined.SP_AppearanceCombined
// 0x0128 (0x0128 - 0x0000)
struct FSP_AppearanceCombined final
{
public:
	int32                                         Head_8_97202B0344F4B4BDC39D4487C643EAB5;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HairStyle_120_DFD8C66348535591316B808F57A8F7FD;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HairColor_123_0D81A3E14415E797E47550A171D62F35;    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FacialHairStyle_128_395631B64609BF3E7D6352AFAE9104C2; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FacialHairColor_125_6A712A9B4970F3C23913518E53E574C1; // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShirtStyle_56_E10F731F4063BD7B3900988B5E3C1685;    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShirtTuckedIn_61_7C529B584EA5C593D528A3AFAF6D97FF; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FBE[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GlovesStyle_71_9C363C8244EBA26E91E7EA917F988512;   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WristbandStyle_76_79770C514F07282C360DB3B7441A7EE4; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShortsStyle_64_AB2571674C5BA115127EDF9851BC1F4D;   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SocksStyle_66_9B734EC343CE860322C83D9CBFB57E6B;    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShoesStyle_68_288BD40F43FA8C2F1639169A2F254C18;    // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BodySize_18_0723B4774D632A6C2C381EB482610348;      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkinTone_13_ECD7EF7D413F3F70589DF59E1D64D6EC;      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EyeColor_16_870392DE4FABFED03F5CFCA24FB21F79;      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShirtPatternDesign_80_ECD70CFA4BA3398030E7A6A73580A0E7; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShirtColor1_105_64B91F384604A4D36578A9A5E77A91E9;  // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShirtColor2_85_38BFB56340388EDB6E2566815238626B;   // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShirtFont_112_C306C5CC43356868E2A650A9B15E38BA;    // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FBF[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ShirtName_101_C88CC4584F5F30E36A76EB8F1745B83C;    // 0x0080(0x0018)(Edit, BlueprintVisible)
	int32                                         ShirtNameSize_108_BF13E4DD4A237E055B9B03970D35D450; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShirtNameVerticalOffset_115_620590114182AB28ECC19186F04A4F47; // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ShirtNumber_103_CCD159264D11FA58380DEF89446FCDBF;  // 0x00A0(0x0018)(Edit, BlueprintVisible)
	int32                                         ShirtNumberSize_110_E8BB23F4408B233345C831A6FCEF466C; // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShirtNumberVerticalOffset_117_8DBD29E14DBA23E384A1319B58A8DE20; // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GlovesColor_130_70CC3C7040BE88B273BD8A998EC9E270;  // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WristbandColor_132_A548DA8A4ADD05702F01D689699A9EF0; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShortsColorDesign_98_A0CEAB1B49368D415835558B42FB4A0E; // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShortsColor1_87_DBF29F3D4029008923EC368227E03271;  // 0x00E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShortsColor2_89_1226672B486C73B208E5A7815A0CBD9B;  // 0x00F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SocksPatternDesign_96_E1E6A55C48F8DAF1C6382BBE32C5322E; // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SocksColor1_91_4839DFD44AF81C7E1E98A6BC0CD3FBD7;   // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SocksColor2_93_E73B851B4B531F4F2C395CB983BF3F2F;   // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

