#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_TeamAppearance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct SP_TeamAppearance.SP_TeamAppearance
// 0x00A0 (0x00A0 - 0x0000)
struct FSP_TeamAppearance final
{
public:
	int32                                         ShirtPatternDesign_80_ECD70CFA4BA3398030E7A6A73580A0E7; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShirtColor1_105_64B91F384604A4D36578A9A5E77A91E9;  // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShirtColor2_85_38BFB56340388EDB6E2566815238626B;   // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShortsPatternDesign_133_A0CEAB1B49368D415835558B42FB4A0E; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShortsColor1_87_DBF29F3D4029008923EC368227E03271;  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShortsColor2_89_1226672B486C73B208E5A7815A0CBD9B;  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SocksPatternDesign_96_E1E6A55C48F8DAF1C6382BBE32C5322E; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SocksColor1_91_4839DFD44AF81C7E1E98A6BC0CD3FBD7;   // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SocksColor2_93_E73B851B4B531F4F2C395CB983BF3F2F;   // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShirtFontStyle_129_C306C5CC43356868E2A650A9B15E38BA; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            ShirtFontColor_134_590FFF9E4346094537E502969D68578B; // 0x0070(0x0028)(Edit, BlueprintVisible)
	int32                                         ShirtFontFrontNumber_137_17A8066C444E070D9C462FA88EF96BA6; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

