#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamCoreWeb

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "SteamCoreWeb_structs.hpp"


namespace SDK
{

// Class SteamCoreWeb.SteamCoreWeb
// 0x0000 (0x0028 - 0x0028)
class USteamCoreWeb final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWeb">();
	}
	static class USteamCoreWeb* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWeb>();
	}
};

// Class SteamCoreWeb.SteamCoreWebAsyncAction
// 0x0028 (0x0058 - 0x0030)
class USteamCoreWebAsyncAction : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnCallback;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A4[0x18];                                    // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCallback(const class FString& Data, bool bWasSuccessful);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebAsyncAction">();
	}
	static class USteamCoreWebAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebAsyncAction>();
	}
};

// Class SteamCoreWeb.SteamCoreWebAsyncActionGetPlayerBans
// 0x0000 (0x0058 - 0x0058)
class USteamCoreWebAsyncActionGetPlayerBans final : public USteamCoreWebAsyncAction
{
public:
	static class USteamCoreWebAsyncActionGetPlayerBans* GetPlayerBansAsync(class UObject* WorldContextObject, const class FString& Key, const TArray<class FString>& SteamIDs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebAsyncActionGetPlayerBans">();
	}
	static class USteamCoreWebAsyncActionGetPlayerBans* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebAsyncActionGetPlayerBans>();
	}
};

// Class SteamCoreWeb.SteamCoreWebSubsystem
// 0x0018 (0x0048 - 0x0030)
class USteamCoreWebSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_14A6[0x18];                                    // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebSubsystem">();
	}
	static class USteamCoreWebSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebSubsystem>();
	}
};

// Class SteamCoreWeb.SteamCoreWebAsyncActionExchangeItem
// 0x0000 (0x0058 - 0x0058)
class USteamCoreWebAsyncActionExchangeItem final : public USteamCoreWebAsyncAction
{
public:
	static class USteamCoreWebAsyncActionExchangeItem* ExchangeItemAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID, const class FString& SteamID, const TArray<int32>& MaterialsItemID, const TArray<int32>& MaterialsQuantity, const class FString& OutputItemdefId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebAsyncActionExchangeItem">();
	}
	static class USteamCoreWebAsyncActionExchangeItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebAsyncActionExchangeItem>();
	}
};

// Class SteamCoreWeb.SteamCoreWebAsyncActionGetNewsForApp
// 0x0000 (0x0058 - 0x0058)
class USteamCoreWebAsyncActionGetNewsForApp final : public USteamCoreWebAsyncAction
{
public:
	static class USteamCoreWebAsyncActionGetNewsForApp* GetNewsForAppAsync(class UObject* WorldContextObject, int32 AppID, int32 MaxLength, const TArray<class FString>& Feeds, int32 EndDate, int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebAsyncActionGetNewsForApp">();
	}
	static class USteamCoreWebAsyncActionGetNewsForApp* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebAsyncActionGetNewsForApp>();
	}
};

// Class SteamCoreWeb.SteamCoreWebSettings
// 0x0040 (0x0078 - 0x0038)
class USteamCoreWebSettings final : public UDeveloperSettings
{
public:
	float                                         AsyncTaskTimeout;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DisabledSubsystems;                                // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugging;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDevMode;                                          // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A8[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key;                                               // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A9[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DevSteamID;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSandboxMode;                                      // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14AA[0x7];                                     // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebSettings">();
	}
	static class USteamCoreWebSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebSettings>();
	}
};

// Class SteamCoreWeb.SteamWebUtilities
// 0x0000 (0x0028 - 0x0028)
class USteamWebUtilities final : public UBlueprintFunctionLibrary
{
public:
	static void FindJsonBool(const class FString& JsonString, const class FString& Key, bool* bValue, ESteamJsonResult* Result);
	static void FindJsonBools(const class FString& JsonString, const class FString& Key, TArray<bool>* bValues, ESteamJsonResult* Result);
	static void FindJsonNumber(const class FString& JsonString, const class FString& Key, int32* Value, ESteamJsonResult* Result);
	static void FindJsonNumbers(const class FString& JsonString, const class FString& Key, TArray<int32>* Values, ESteamJsonResult* Result);
