#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamCustomization

#include "Basic.hpp"

#include "TeamInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SP_TeamAppearance_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CustomTeam_structs.hpp"


namespace SDK::Params
{

// Function TeamCustomization.TeamCustomization_C.ExecuteUbergraph_TeamCustomization
// 0x13E50 (0x13E50 - 0x0000)
struct TeamCustomization_C_ExecuteUbergraph_TeamCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_6;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0020(0x0018)()
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_267F[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_6;             // 0x0060(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2680[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance;               // 0x0078(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam;                      // 0x0118(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_1;             // 0x0508(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_1;                    // 0x05A8(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_2;             // 0x0998(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_2;                    // 0x0A38(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_3;             // 0x0E28(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_3;                    // 0x0EC8(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_4;             // 0x12B8(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_4;                    // 0x1358(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_5;             // 0x1748(0x00A0)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_1;            // 0x17E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_5;                    // 0x17F8(0x03F0)(HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x1BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x1BEC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x1BFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2681[0x3];                                     // 0x1BFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_5;             // 0x1C00(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_5;                // 0x1C10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x1C14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2682[0x3];                                     // 0x1C15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_6;             // 0x1C18(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_7;             // 0x1CB8(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_6;                    // 0x1D58(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_7;                    // 0x2148(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_8;             // 0x2538(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_9;             // 0x25D8(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_8;                    // 0x2678(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_9;                    // 0x2A68(0x03F0)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_2;            // 0x2E58(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x2E68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x2E6C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_4;                 // 0x2E7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2683[0x3];                                     // 0x2E7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_3;            // 0x2E80(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_3;                   // 0x2E90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x2E94(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_5;                 // 0x2EA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2684[0x3];                                     // 0x2EA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_4;             // 0x2EA8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_4;                // 0x2EB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_3;             // 0x2EBC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_3;                // 0x2ECC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_10;            // 0x2ED0(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_11;            // 0x2F70(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_10;                   // 0x3010(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_11;                   // 0x3400(0x03F0)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_InputPin_6;                     // 0x37F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_InputPin_5;                     // 0x3800(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_12;            // 0x3810(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_13;            // 0x38B0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_12;                   // 0x3950(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_13;                   // 0x3D40(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_14;            // 0x4130(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_15;            // 0x41D0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_14;                   // 0x4270(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_15;                   // 0x4660(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_16;            // 0x4A50(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_17;            // 0x4AF0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_16;                   // 0x4B90(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_17;                   // 0x4F80(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_18;            // 0x5370(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_19;            // 0x5410(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_18;                   // 0x54B0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_19;                   // 0x58A0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_20;            // 0x5C90(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_21;            // 0x5D30(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_20;                   // 0x5DD0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_21;                   // 0x61C0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_22;            // 0x65B0(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_23;            // 0x6650(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_22;                   // 0x66F0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_23;                   // 0x6AE0(0x03F0)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_InputPin_4;                     // 0x6ED0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_24;            // 0x6EE0(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_25;            // 0x6F80(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_24;                   // 0x7020(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_25;                   // 0x7410(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_26;            // 0x7800(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_26;                   // 0x78A0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_27;            // 0x7C90(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_28;            // 0x7D30(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_27;                   // 0x7DD0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_28;                   // 0x81C0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_29;            // 0x85B0(0x00A0)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_InputPin_3;                     // 0x8650(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_29;                   // 0x8660(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_30;            // 0x8A50(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_30;                   // 0x8AF0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_31;            // 0x8EE0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_31;                   // 0x8F80(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_32;            // 0x9370(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_33;            // 0x9410(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_32;                   // 0x94B0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_33;                   // 0x98A0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_34;            // 0x9C90(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_35;            // 0x9D30(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_34;                   // 0x9DD0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_35;                   // 0xA1C0(0x03F0)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_6;                 // 0xA5B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2685[0x7];                                     // 0xA5B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSP_TeamAppearance                     K2Node_CustomEvent_SP_TeamAppearance;              // 0xA5B8(0x00A0)(ConstParm, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0xA658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0xA65C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0xA660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0xA664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0xA668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0xA66C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0xA670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0xA674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0xA678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0xA688(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_2;                           // 0xA698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_2;                           // 0xA69C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_2;                           // 0xA6A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_2;                           // 0xA6A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_3;                           // 0xA6A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_3;                           // 0xA6AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_3;                           // 0xA6B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_3;                           // 0xA6B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0xA6B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_3;                   // 0xA6C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_4;                           // 0xA6D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_4;                           // 0xA6DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_4;                           // 0xA6E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_4;                           // 0xA6E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_5;                           // 0xA6E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_5;                           // 0xA6EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_5;                           // 0xA6F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_5;                           // 0xA6F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_4;                   // 0xA6F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_5;                   // 0xA708(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_6;                           // 0xA718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_6;                           // 0xA71C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_6;                           // 0xA720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_6;                           // 0xA724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_4;            // 0xA728(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_6;                   // 0xA738(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_4;                   // 0xA748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_7;                 // 0xA74C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2686[0x3];                                     // 0xA74D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_4;                  // 0xA750(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_8;                 // 0xA760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2687[0x3];                                     // 0xA761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_5;            // 0xA764(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_5;                   // 0xA774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_5;                  // 0xA778(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_9;                 // 0xA788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2688[0x3];                                     // 0xA789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_InputPin_2;                     // 0xA78C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_InputPin_1;                     // 0xA79C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2689[0x4];                                     // 0xA7AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_36;            // 0xA7B0(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_37;            // 0xA850(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_36;                   // 0xA8F0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_37;                   // 0xACE0(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_38;            // 0xB0D0(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_39;            // 0xB170(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_38;                   // 0xB210(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_39;                   // 0xB600(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_40;            // 0xB9F0(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_41;            // 0xBA90(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_40;                   // 0xBB30(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_41;                   // 0xBF20(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_42;            // 0xC310(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_43;            // 0xC3B0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_42;                   // 0xC450(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_43;                   // 0xC840(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_44;            // 0xCC30(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_45;            // 0xCCD0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_44;                   // 0xCD70(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_45;                   // 0xD160(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_46;            // 0xD550(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_47;            // 0xD5F0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_46;                   // 0xD690(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_47;                   // 0xDA80(0x03F0)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_2;             // 0xDE70(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0xDE80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_1;             // 0xDE84(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0xDE94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_48;            // 0xDE98(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_49;            // 0xDF38(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_48;                   // 0xDFD8(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_49;                   // 0xE3C8(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_50;            // 0xE7B8(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_50;                   // 0xE858(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_51;            // 0xEC48(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_51;                   // 0xECE8(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_52;            // 0xF0D8(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_53;            // 0xF178(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_52;                   // 0xF218(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_53;                   // 0xF608(0x03F0)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0xF9F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0xFA08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0xFA09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_268A[0x2];                                     // 0xFA0A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0xFA0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_10;                // 0xFA10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_268B[0x7];                                     // 0xFA11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0xFA18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMM_Character_C*                        K2Node_DynamicCast_AsMM_Character;                 // 0xFA20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0xFA28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_268C[0x7];                                     // 0xFA29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_54;            // 0xFA30(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_55;            // 0xFAD0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_54;                   // 0xFB70(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_55;                   // 0xFF60(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_56;            // 0x10350(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_57;            // 0x103F0(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_56;                   // 0x10490(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_57;                   // 0x10880(0x03F0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_58;            // 0x10C70(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_59;            // 0x10D10(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_58;                   // 0x10DB0(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_59;                   // 0x111A0(0x03F0)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor;               // 0x11590(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x115A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_11;                // 0x115A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_268D[0x3];                                     // 0x115A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x115A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x115B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_InputPin;                       // 0x115B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x115C8(0x0028)()
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_60;            // 0x115F0(0x00A0)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x11690(0x0028)()
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_61;            // 0x116B8(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_60;                   // 0x11758(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_61;                   // 0x11B48(0x03F0)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x11F38(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x11F60(0x0028)()
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_62;            // 0x11F88(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_63;            // 0x12028(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_62;                   // 0x120C8(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_63;                   // 0x124B8(0x03F0)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x128A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x128D0(0x0028)()
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_64;            // 0x128F8(0x00A0)(HasGetValueTypeHash)
	struct FSP_TeamAppearance                     K2Node_MakeStruct_SP_TeamAppearance_65;            // 0x12998(0x00A0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_64;                   // 0x12A38(0x03F0)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_65;                   // 0x12E28(0x03F0)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_6;            // 0x13218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_6;                   // 0x13228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_6;                  // 0x1322C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_7;            // 0x1323C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_7;                   // 0x1324C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_8;            // 0x13250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_8;                   // 0x13260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_9;            // 0x13264(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_9;                   // 0x13274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_10;           // 0x13278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_10;                  // 0x13288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_7;                  // 0x1328C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x1329C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x132A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x132A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_8;                  // 0x132A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_9;                  // 0x132B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_10;                 // 0x132C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_11;                 // 0x132D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_12;                 // 0x132E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_11;           // 0x132F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_11;                  // 0x13308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_12;           // 0x1330C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_12;                  // 0x1331C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetCurrentColor_ReturnValue_13;           // 0x13320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_13;                  // 0x13330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_13;                 // 0x13334(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268E[0x4];                                     // 0x13344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x13348(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x13360(0x0018)(ConstParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x13378(0x0018)()
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue; // 0x13390(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x133A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x133C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue_1; // 0x133D0(0x0018)()
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x133E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x133F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x13408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTeamInfo                              K2Node_MakeStruct_TeamInfo;                        // 0x13418(0x0030)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x13448(0x0018)()
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_66;                   // 0x13460(0x03F0)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x13850(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_2;               // 0x13860(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x13870(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x13888(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x138A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_3;               // 0x138B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x138C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x138C8(0x0018)()
	class UPSO_GameInstance_C*                    K2Node_DynamicCast_AsPSO_Game_Instance;            // 0x138E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x138E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_268F[0x7];                                     // 0x138E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x138F0(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x13908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x13909(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2690[0x6];                                     // 0x1390A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x13910(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x13928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x13929(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2691[0x6];                                     // 0x1392A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x13930(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x13948(0x0018)()
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue_2; // 0x13960(0x0018)()
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue_3; // 0x13978(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x13990(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x139A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_4;               // 0x139B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_5;               // 0x139C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTeamInfo                              K2Node_MakeStruct_TeamInfo_1;                      // 0x139D0(0x0030)(HasGetValueTypeHash)
	struct FCustomTeam                            K2Node_MakeStruct_CustomTeam_67;                   // 0x13A00(0x03F0)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x13DF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    K2Node_DynamicCast_AsPSO_Game_Instance_1;          // 0x13DF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x13E00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x13E01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2692[0x6];                                     // 0x13E02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x13E08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    K2Node_DynamicCast_AsPSO_Game_Instance_2;          // 0x13E10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x13E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2693[0x7];                                     // 0x13E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x13E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    K2Node_DynamicCast_AsPSO_Game_Instance_3;          // 0x13E28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x13E30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2694[0x7];                                     // 0x13E31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x13E38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPSO_GameInstance_C*                    K2Node_DynamicCast_AsPSO_Game_Instance_4;          // 0x13E40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x13E48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_TeamAbbreviation_K2Node_ComponentBoundEvent_58_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_TeamAbbreviation_K2Node_ComponentBoundEvent_58_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_TeamName_K2Node_ComponentBoundEvent_51_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_TeamName_K2Node_ComponentBoundEvent_51_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_TeamAbbreviation_K2Node_ComponentBoundEvent_50_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_TeamAbbreviation_K2Node_ComponentBoundEvent_50_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_TeamName_K2Node_ComponentBoundEvent_49_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_TeamName_K2Node_ComponentBoundEvent_49_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function TeamCustomization.TeamCustomization_C.UpdateShirtFontColor
// 0x0010 (0x0010 - 0x0000)
struct TeamCustomization_C_UpdateShirtFontColor final
{
public:
	struct FLinearColor                           InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_ShirtFontColorSlider_K2Node_ComponentBoundEvent_34_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_ShirtFontColorSlider_K2Node_ComponentBoundEvent_34_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_ShirtFontColor_K2Node_ComponentBoundEvent_33_ColorChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_ShirtFontColor_K2Node_ComponentBoundEvent_33_ColorChangedEvent__DelegateSignature final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_ShortFrontNumber_K2Node_ComponentBoundEvent_19_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_ShortFrontNumber_K2Node_ComponentBoundEvent_19_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_SocksColor2Slider_K2Node_ComponentBoundEvent_61_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TeamCustomization_C_BndEvt__TeamCustomization_SocksColor2Slider_K2Node_ComponentBoundEvent_61_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TeamCustomization.TeamCustomization_C.BndEvt__TeamCustomization_SocksColor2_K2Node_ComponentBoundEvent_59_ColorChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
