#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TR_Tutorial_GoalKeeping

#include "Basic.hpp"


namespace SDK::Params
{

// Function TR_Tutorial_GoalKeeping.TR_Tutorial_GoalKeeping_C.ExecuteUbergraph_TR_Tutorial_GoalKeeping
// 0x0018 (0x0018 - 0x0000)
struct TR_Tutorial_GoalKeeping_C_ExecuteUbergraph_TR_Tutorial_GoalKeeping final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2261[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATutorial_GoalKeeping_C*                CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

